In [1]:
#Import dependencies
import requests
import pandas as pd
import re
import sqlite3
import uuid

# Astronauts Cleanup

In [2]:
#Read csv
file = 'astronauts.csv'
astro_df = pd.read_csv(file)
astro_df.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,NaN,NaN,Retired,3/7/1936,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN

In [3]:
#Remove all years greater than 1991
astro_df = astro_df[astro_df['Year'] <= 1991]
astro_df.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN
5,Andrew M. Allen,1987.0,12.0,Retired,8/4/1955,"Philadelphia, PA",Male,Villanova University; University of Florida,Mechanical Engineering,Business Administration,Lieutenant Colonel,US Marine Corps (Retired),3,906,0,0.0,"STS-46 (Atlantis), STS-62 (Columbia), STS-75 (...",NaN,NaN
6,Joseph P. Allen,1967.0,6.0,Retired,6/27/1937,"Crawsfordsville, IN",Male,DePauw University; Yale University,Mathematics & Physics,Physics,NaN,NaN,2,313,2,12.0,"ST-5 (Columbia), STS 51-A (Discovery)",NaN,NaN

In [4]:
#Change floats to int
astro_df["Year"] = astro_df["Year"].astype(int)
astro_df["Group"] = astro_df["Group"].astype(int)

astro_df.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
2,James C. Adamson,1984,10,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987,12,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963,3,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN
5,Andrew M. Allen,1987,12,Retired,8/4/1955,"Philadelphia, PA",Male,Villanova University; University of Florida,Mechanical Engineering,Business Administration,Lieutenant Colonel,US Marine Corps (Retired),3,906,0,0.0,"STS-46 (Atlantis), STS-62 (Columbia), STS-75 (...",NaN,NaN
6,Joseph P. Allen,1967,6,Retired,6/27/1937,"Crawsfordsville, IN",Male,DePauw University; Yale University,Mathematics & Physics,Physics,NaN,NaN,2,313,2,12.0,"ST-5 (Columbia), STS 51-A (Discovery)",NaN,NaN

In [5]:
#Strip 'jr' from last name
def strip_jr(name):
    if "Jr." in name:
        result = name[:-4]
    else:
        result = name
    return (result)

astro_df['Name'] = astro_df['Name'].apply(strip_jr)
astro_df.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
2,James C. Adamson,1984,10,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987,12,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963,3,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN
5,Andrew M. Allen,1987,12,Retired,8/4/1955,"Philadelphia, PA",Male,Villanova University; University of Florida,Mechanical Engineering,Business Administration,Lieutenant Colonel,US Marine Corps (Retired),3,906,0,0.0,"STS-46 (Atlantis), STS-62 (Columbia), STS-75 (...",NaN,NaN
6,Joseph P. Allen,1967,6,Retired,6/27/1937,"Crawsfordsville, IN",Male,DePauw University; Yale University,Mathematics & Physics,Physics,NaN,NaN,2,313,2,12.0,"ST-5 (Columbia), STS 51-A (Discovery)",NaN,NaN

In [6]:
#Split functions
def split_first(astro_string):
    if "." in astro_string:
        if "." in astro_string.split(".")[1]:
            first_name = astro_string.split('.')[0] + "." + astro_string.split('.')[0] + "."
        else:
            first_name = astro_string.split('.')[0] + "."
    else:
        first_name = astro_string.split()[0]
    return(first_name)
        
def split_last(astro_string):
    if "." in astro_string:
        last_name = astro_string.split('.')[1]
        last_name = last_name.strip()
    else:
        last_name = astro_string.split()[1]
    return(last_name)

#Assign to new columns
astro_df['First Name'] = astro_df['Name'].apply(split_first)
astro_df['Last Name'] = astro_df['Name'].apply(split_last)


#Rename Name to Full-Name
astro_df = astro_df.rename(columns={"Name":"Full Name"})
astro_df.head()

,Full Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,...,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission,First Name,Last Name
2,James C. Adamson,1984,10,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,...,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN,James C.,Adamson
3,Thomas D. Akers,1987,12,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,...,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN,Thomas D.,Akers
4,Buzz Aldrin,1963,3,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,...,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN,Buzz,Aldrin
5,Andrew M. Allen,1987,12,Retired,8/4/1955,"Philadelphia, PA",Male,Villanova University; University of Florida,Mechanical Engineering,Business Administration,...,US Marine Corps (Retired),3,906,0,0.0,"STS-46 (Atlantis), STS-62 (Columbia), STS-75 (...",NaN,NaN,Andrew M.,Allen
6,Joseph P. Allen,1967,6,Retired,6/27/1937,"Crawsfordsville, IN",Male,DePauw University; Yale University,Mathematics & Physics,Physics,...,NaN,2,313,2,12.0,"ST-5 (Columbia), STS 51-A (Discovery)",NaN,NaN,Joseph P.,Allen

In [7]:
#Reorder Columns
f_column = astro_df.pop('First Name')
l_column = astro_df.pop('Last Name')
mission_column = astro_df.pop('Missions')
astro_df.insert(1, f_column.name, f_column)
astro_df.insert(2, l_column.name, l_column)
astro_df.insert(3, mission_column.name, mission_column)
astro_df.head()

,Full Name,First Name,Last Name,Missions,Year,Group,Status,Birth Date,Birth Place,Gender,...,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Death Date,Death Mission
2,James C. Adamson,James C.,Adamson,"STS-28 (Columbia), STS-43 (Atlantis)",1984,10,Retired,3/3/1946,"Warsaw, NY",Male,...,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,NaN,NaN
3,Thomas D. Akers,Thomas D.,Akers,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",1987,12,Retired,5/20/1951,"St. Louis, MO",Male,...,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,NaN,NaN
4,Buzz Aldrin,Buzz,Aldrin,"Gemini 12, Apollo 11",1963,3,Retired,1/20/1930,"Montclair, NJ",Male,...,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,NaN,NaN
5,Andrew M. Allen,Andrew M.,Allen,"STS-46 (Atlantis), STS-62 (Columbia), STS-75 (...",1987,12,Retired,8/4/1955,"Philadelphia, PA",Male,...,Mechanical Engineering,Business Administration,Lieutenant Colonel,US Marine Corps (Retired),3,906,0,0.0,NaN,NaN
6,Joseph P. Allen,Joseph P.,Allen,"ST-5 (Columbia), STS 51-A (Discovery)",1967,6,Retired,6/27/1937,"Crawsfordsville, IN",Male,...,Mathematics & Physics,Physics,NaN,NaN,2,313,2,12.0,NaN,NaN

In [8]:
#Remove all astronauts who didn't pursue missions
astro_df = astro_df[astro_df['Missions'].notnull()]
astro_df.head()

,Full Name,First Name,Last Name,Missions,Year,Group,Status,Birth Date,Birth Place,Gender,...,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Death Date,Death Mission
2,James C. Adamson,James C.,Adamson,"STS-28 (Columbia), STS-43 (Atlantis)",1984,10,Retired,3/3/1946,"Warsaw, NY",Male,...,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,NaN,NaN
3,Thomas D. Akers,Thomas D.,Akers,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",1987,12,Retired,5/20/1951,"St. Louis, MO",Male,...,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,NaN,NaN
4,Buzz Aldrin,Buzz,Aldrin,"Gemini 12, Apollo 11",1963,3,Retired,1/20/1930,"Montclair, NJ",Male,...,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,NaN,NaN
5,Andrew M. Allen,Andrew M.,Allen,"STS-46 (Atlantis), STS-62 (Columbia), STS-75 (...",1987,12,Retired,8/4/1955,"Philadelphia, PA",Male,...,Mechanical Engineering,Business Administration,Lieutenant Colonel,US Marine Corps (Retired),3,906,0,0.0,NaN,NaN
6,Joseph P. Allen,Joseph P.,Allen,"ST-5 (Columbia), STS 51-A (Discovery)",1967,6,Retired,6/27/1937,"Crawsfordsville, IN",Male,...,Mathematics & Physics,Physics,NaN,NaN,2,313,2,12.0,NaN,NaN

In [9]:
#Remove all mission related data
astro_df = astro_df.drop(["Missions"], axis=1)

#Apply sort based on Crew Member's Name
astro_df = astro_df.sort_values(by=["Full Name"])

#Reset index
astro_df = astro_df.reset_index(drop=True)

astro_df.head()

,Full Name,First Name,Last Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Death Date,Death Mission
0,Alan B. Shepard,Alan B.,Shepard,1959,1,Deceased,11/18/1923,"East Derry, NH",Male,US Naval Academy,Naval Sciences,NaN,Rear Admiral,US Navy (Retired),2,216,2,9.0,7/21/1998,NaN
1,Alan L. Bean,Alan L.,Bean,1963,3,Retired,3/15/1932,"Wheeler, TX",Male,University of Texas,Aeronautical Engineering,NaN,Captain,US Navy (Retired),2,1671,3,10.0,NaN,NaN
2,Alfred M. Worden,Alfred M.,Worden,1966,5,Retired,2/7/1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,NaN,NaN
3,Andrew M. Allen,Andrew M.,Allen,1987,12,Retired,8/4/1955,"Philadelphia, PA",Male,Villanova University; University of Florida,Mechanical Engineering,Business Administration,Lieutenant Colonel,US Marine Corps (Retired),3,906,0,0.0,NaN,NaN
4,Anna L. Fisher,Anna L.,Fisher,1978,8,Management,8/24/1949,"New York, NY",Female,University of California-Los Angeles,Chemistry,Chemistry; Medicine,NaN,NaN,1,191,0,0.0,NaN,NaN

In [10]:
#insert first column - astro_id 
def assign_astro_id(item):
    result = "A-"+str(uuid.uuid4().fields[-1])[:5]
    return(result)
astro_df["Astro ID"] = astro_df["Full Name"].apply(assign_astro_id)

id_column = astro_df.pop('Astro ID')
astro_df.insert(0, id_column.name, id_column)

astro_df

,Astro ID,Full Name,First Name,Last Name,Year,Group,Status,Birth Date,Birth Place,Gender,...,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Death Date,Death Mission
0,A-21199,Alan B. Shepard,Alan B.,Shepard,1959,1,Deceased,11/18/1923,"East Derry, NH",Male,...,Naval Sciences,NaN,Rear Admiral,US Navy (Retired),2,216,2,9.0,7/21/1998,NaN
1,A-21584,Alan L. Bean,Alan L.,Bean,1963,3,Retired,3/15/1932,"Wheeler, TX",Male,...,Aeronautical Engineering,NaN,Captain,US Navy (Retired),2,1671,3,10.0,NaN,NaN
2,A-58143,Alfred M. Worden,Alfred M.,Worden,1966,5,Retired,2/7/1932,"Jackson, MI",Male,...,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,NaN,NaN
3,A-83466,Andrew M. Allen,Andrew M.,Allen,1987,12,Retired,8/4/1955,"Philadelphia, PA",Male,...,Mechanical Engineering,Business Administration,Lieutenant Colonel,US Marine Corps (Retired),3,906,0,0.0,NaN,NaN
4,A-10163,Anna L. Fisher,Anna L.,Fisher,1978,8,Management,8/24/1949,"New York, NY",Female,...,Chemistry,Chemistry; Medicine,NaN,NaN,1,191,0,0.0,NaN,NaN
5,A-44933,Anthony W. England,Anthony W.,England,1967,6,Retired,5/15/1942,"Indianapolis, IN",Male,...,Geology,Geology; Geophysics,NaN,NaN,1,190,0,0.0,NaN,NaN
6,A-14344,Bernard A. Harris,Bernard A.,Harris,1990,13,Retired,6/26/1956,"Temple, TX",Male,...,Biology,Medicine,NaN,NaN,2,438,1,5.0,NaN,NaN
7,A-13120,Bonnie J. Dunbar,Bonnie J.,Dunbar,1980,9,Retired,3/3/1949,"Sunnyside, WA",Female,...,Ceramic Engineering,Ceramic Engineering; Biomedical Engineering,NaN,NaN,5,1207,0,0.0,NaN,NaN
8,A-13074,Brewster H. Shaw,Brewster H.,Shaw,1978,8,Retired,5/16/1945,"Cass City, MI",Male,...,Engineering Mechanics,Engineering Mechanics,Colonel,US Air Force (Retired),3,533,0,0.0,NaN,NaN
9,A-24473,Brian Duffy,Brian,Duffy,1985,11,Retired,6/20/1953,"Boston, MA",Male,...,Mathematics,Systems Management,Colonel,US Air Force (Retired),4,977,0,0.0,NaN,NaN
10,A-95393,Bruce E. Melnick,Bruce E.,Melnick,1987,12,Retired,12/5/1949,"New York, NY",Male,...,Engineering,Aeronautical Systems,Commander,US Coast Guard (Retired),2,311,0,0.0,NaN,NaN
11,A-11033,Bruce McCandless II,Bruce,McCandless,1966,5,Retired,6/8/1937,"Boston, MA",Male,...,NaN,Electrical Engineering; Business Administration,Captain,US Navy (Retired),2,312,2,12.0,NaN,NaN
12,A-96573,Bryan D. O'Connor,Bryan D.,O'Connor,1980,9,Retired,9/6/1946,"Orange, CA",Male,...,Engineering,Aeronautical Systems,Colonel,US Marine Corps (Retired),2,383,0,0.0,NaN,NaN
13,A-15342,Buzz Aldrin,Buzz,Aldrin,1963,3,Retired,1/20/1930,"Montclair, NJ",Male,...,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,NaN,NaN
14,A-13447,C. Gordon Fullerton,C.,Gordon Fullerton,1969,7,Retired,10/11/1936,"Rochester, NY",Male,...,Mechanical Engineering,Mechanical Engineering,Colonel,US Air Force (Retired),2,382,0,0.0,NaN,NaN
15,A-84371,C. Michael Foale,C.,Michael Foale,1987,12,Active,1/6/1957,"Louth, England",Male,...,Physics,Laboratory Astrophysics,NaN,NaN,6,8970,4,22.0,NaN,NaN
16,A-78555,Carl E. Walz,Carl E.,Walz,1990,13,Retired,9/6/1955,"Cleveland, OH",Male,...,Physics,Solid State Physics,Colonel,US Air Force,4,5533,3,19.0,NaN,NaN
17,A-18521,Carl J. Meade,Carl J.,Meade,1985,11,Retired,11/16/1950,"Chanute Air Force Base, IL",Male,...,Electronics Engineering,Electronics Engineering,Colonel,US Air Force (Retired),3,712,1,6.0,NaN,NaN
18,A-13511,Charles Conrad,Charles,Conrad,1962,2,Deceased,5/2/1930,"Philadelphia, PA",Male,...,Aeronautical Engineering,NaN,Captain,US Navy (Retired),4,1179,4,12.0,7/8/1999,NaN
19,A-24251,Charles D. Gemar,Charles D.,Gemar,1985,11,Retired,8/4/1955,"Yanktown, SD",Male,...,Engineering,NaN,Lieutenant Colonel,US Army,3,581,0,0.0,NaN,NaN
20,A-13581,Charles F. Bolden,Charles F.,Bolden,1980,9,Management,8/19/1946,"Columbia, SC",Male,...,Electrical Science,Systems Management,Major General,US Marine Corps (Retired),4,680,0,0.0,NaN,NaN
21,A-12259,Charles J. Precourt,Charles J.,Precourt,1990,13,Retired,6/29/1955,"Waltham, MA",Male,...,Aeronautical Engineering,Engineering Management; Strategic Studies,Colonel,US Air Force (Retired),4,950,0,0.0,NaN,NaN
22,A-15716,Charles Lacy Veach,Charles,Lacy,1984,10,Deceased,9/18/1944,"Chicago, IL",Male,...,Engineering Management,NaN,NaN,NaN,2,436,0,0.0,10/3/1995,NaN
23,A-26775,Charles M. Duke,Charles M.,Duke,1966,5,Retired,10/3/1935,"Charlotte, NC",Male,...,Naval Sciences,Aeronautics,Brigadier General,US Air Force (Retired),1,265,3,20.0,NaN,NaN
24,A-49304,Curtis L. Brown,Curtis L.,Brown,1987,12,Retired,3/11/1956,"Elizabethtown, NC",Male,...,Electrical Engineering,NaN,Colonel,US Air Force (Retired),6,1383,0,0.0,NaN,NaN
25,A-10678,Dale A. Gardner,Dale A.,Gardner,1978,8,Retired,11/8/1948,"Fairmont, MN",Male,...,Engineering Physics,NaN,Captain,US Navy (Retired),2,336,2,12.0,NaN,NaN
26,A-18102,Daniel C. Brandenstein,Daniel C.,Brandenstein,1978,8,Retired,1/17/1943,"Watertown, WI",Male,...,Mathematics & Physics,NaN,Captain,US Navy (Retired),4,789,0,0.0,NaN,NaN
27,A-25515,Daniel W. Bursch,Daniel W.,Bursch,1990,13,Retired,7/25/1957,"Bristol, PA",Male,...,Physics,Engineering Science,Captain,US Navy (Retired),4,5446,2,12.0,NaN,NaN
28,A-11719,David A. Wolf,David A.,Wolf,1990,13,Retired,8/23/1956,"Indianapolis, IN",Male,...,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,NaN,NaN
29,A-14581,David C. Hilmers,David C.,Hilmers,1980,9,Retired,1/28/1950,"Clinton, IA",Male,...,Mathematics,Electrical Engineering,Colonel,US Marine Corps (Retired),4,494,0,0.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,A-14081,Shannon W. Lucid,Shannon W.,Lucid,1978,8,Retired,1/14/1943,"Shanghai, China",Female,...,Chemistry,Biochemistry,NaN,NaN,5,5354,0,0.0,NaN,NaN
153,A-19028,Sherwood C. Spring,Sherwood C.,Spring,1980,9,Retired,9/23/1944,"Hartford, CT",Male,...,Engineering,Aerospace Engineering,Colonel,US Army (Retired),1,165,2,12.0,NaN,NaN
154,A-23543,Sidney M. Gutierrez,Sidney M.,Gutierrez,1984,10,Retired,6/27/1951,"Albuquerque, NM",Male,...,Aeronautical Engineering,Business Management,Colonel,US Air Force (Retired),2,488,0,0.0,NaN,NaN
155,A-15340,Stephen S. Oswald,Stephen S.,Oswald,1985,11,Retired,6/30/1951,"Seattle, WA",Male,...,Aerospace Engineering,NaN,NaN,NaN,3,814,0,0.0,NaN,NaN
156,A-27165,Steven A. Hawley,Steven A.,Hawley,1978,8,Retired,12/12/1951,"Ottawa, KS",Male,...,Physics & Astronomy,Astronomy & Astrophysics,NaN,NaN,5,770,0,0.0,NaN,NaN
157,A-12609,Steven R. Nagel,Steven R.,Nagel,1978,8,Retired,10/27/1946,"Canton, IL",Male,...,Aerospace Engineering,Mechanical Engineering,Colonel,US Air Force (Retired),4,721,0,0.0,NaN,NaN
158,A-19950,Story Musgrave,Story,Musgrave,1967,6,Retired,8/19/1935,"Boston, MA",Male,...,Mathematics & Statistics; Chemistry,Business Administration; Physiology; Literatur...,NaN,NaN,6,1281,4,26.0,NaN,NaN
159,A-22935,Stuart A. Roosa,Stuart A.,Roosa,1966,5,Deceased,8/16/1933,"Durango, CO",Male,...,Aeronautical Engineering,NaN,Colonel,US Air Force (Retired),1,216,0,0.0,12/12/1994,NaN
160,A-62971,Susan J. Helms,Susan J.,Helms,1990,13,Retired,2/26/1958,"Charlotte, NC",Female,...,Aeronautical Engineering,Aeronautics & Astronautics,Lieutenant General,US Air Force,5,5063,1,9.0,NaN,NaN
161,A-70771,Tamara E. Jernigan,Tamara E.,Jernigan,1985,11,Retired,5/7/1959,"Chattanooga, TN",Female,...,Physics,Engineering Science; Astronomy,NaN,NaN,5,1489,1,8.0,NaN,NaN
162,A-49231,Terence T. Henricks,Terence T.,Henricks,1985,11,Retired,7/5/1952,"Bryan, OH",Male,...,Civil Engineering,Public Administration,Colonel,US Air Force (Retired),4,1026,0,0.0,NaN,NaN
163,A-95145,Terrence W. Wilcutt,Terrence W.,Wilcutt,1990,13,Management,10/31/1949,"Russellville, KY",Male,...,Mathematics,NaN,NaN,NaN,4,1008,0,0.0,NaN,NaN
164,A-25206,Terry J. Hart,Terry J.,Hart,1978,8,Retired,10/27/1946,"Pittsburgh, PA",Male,...,Mechanical Engineering,Mechanical Engineering; Electrical Engineering,NaN,NaN,1,167,0,0.0,NaN,NaN
165,A-76046,Thomas D. Akers,Thomas D.,Akers,1987,12,Retired,5/20/1951,"St. Louis, MO",Male,...,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,NaN,NaN
166,A-11803,Thomas D. Jones,Thomas D.,Jones,1990,13,Retired,1/22/1955,"Baltimore, MD",Male,...,NaN,Planetary Science,NaN,NaN,4,1272,3,20.0,NaN,NaN
167,A-19915,Thomas K. Mattingly II,Thomas K.,Mattingly II,1966,5,Retired,3/17/1936,"Chicago, IL",Male,...,Aeronautical Engineering,NaN,Rear Admiral,US Navy (Retired),3,508,1,1.0,NaN,NaN
168,A-70375,Thomas P. Stafford,Thomas P.,Stafford,1962,2,Retired,9/17/1930,"Weatherford, OK",Male,...,NaN,NaN,Lieutenant General,US Air Force (Retired),4,507,0,0.0,NaN,NaN
169,A-11762,Vance D. Brand,Vance D.,Brand,1966,5,Retired,5/9/1931,"Longmont, CA",Male,...,Business Management; Aeronautical Engineering,Business Administration,NaN,US Marine Corps Reserves,4,752,0,0.0,NaN,NaN
170,A-14747,Virgil I. Grissom,Virgil I.,Grissom,1959,1,Deceased,4/3/1926,"Mitchell, IN",Male,...,Mechanical Engineering,NaN,Lieutenant Colonel,US Air Force,2,5,0,0.0,1/27/1967,Apollo 1
171,A-21124,Walter Cunningham,Walter,Cunningham,1963,3,Retired,3/16/1932,"Creston, IA",Male,...,Physics,Physics,Colonel,US Marine Corps Reserves,1,260,0,0.0,NaN,NaN
172,A-26522,Walter M. Schirra,Walter M.,Schirra,1959,1,Deceased,3/12/1923,"Hackensack, NJ",Male,...,Naval Sciences,NaN,Captain,US Navy (Retired),3,295,0,0.0,5/2/2007,NaN
173,A-24771,William A. Anders,William A.,Anders,1963,3,Retired,10/17/1933,Hong Kong,Male,...,Nuclear Engineering,Nuclear Engineering,Major General,US Air Force Reserves (Retired),1,147,0,0.0,NaN,NaN
174,A-12158,William B. Lenoir,William B.,Lenoir,1967,6,Deceased,3/14/1939,"Miami, FL",Male,...,Electrical Engineering,Electrical Engineering,NaN,NaN,1,122,0,0.0,8/26/2012,NaN
175,A-43123,William E. Thornton,William E.,Thornton,1967,6,Retired,4/14/1929,"Faison, NC",Male,...,Physics,Medicine,NaN,NaN,2,315,0,0.0,NaN,NaN
176,A-21313,William F. Fisher,William F.,Fisher,1980,9,Retired,4/1/1946,"Dallas, TX",Male,...,NaN,Engineering; Medicine,NaN,NaN,1,170,2,12.0,NaN,NaN
177,A-17816,William F. Readdy,William F.,Readdy,1987,12,Retired,1/24/1952,"Quonset Point, RI",Male,...,Aerospace Engineering,NaN,Captain,US Navy (Retired),3,672,0,0.0,NaN,NaN
178,A-24449,William G. Gregory,William G.,Gregory,1990,13,Retired,5/14/1957,"Lockport, NY",Male,...,Engineering Science,Engineering Mechanics; Business Management,Lieutenant Colonel,US Air Force,1,399,0,0.0,NaN,NaN
179,A-66416,William M. Shepherd,William M.,Shepherd,1984,10,Retired,7/26/1949,"Oak Ridge, TN",Male,...,Aerospace Engineering,Mechanical Engineering,Captain,US Navy (Retired),4,3823,0,0.0,NaN,NaN
180,A-16224,William R. Pogue,William R.,Pogue,1966,5,Retired,1/23/1930,"Okemah, OK",Male,...,Education,Mathematics,Colonel,US Air Force (Retired),1,2017,2,13.0,NaN,NaN
181,A-24901,William S. McArthur,William S.,McArthur,1990,3,Management,7/26/1951,"Laurinburg, NC",Male,...,Applied Science & Engineering,Aerospace Engineering,Colonel,US Army (Retired),4,5398,4,24.0,NaN,NaN

# Mission Cleanup

In [11]:
#Set up url
url = 'https://www.windows2universe.org/space_missions/manned_table.html'

#Retrieve page
tables = pd.read_html(url)

#Create df
df_mission = tables[0]

df_mission.head()

,0,1,2,3,4
0,Mission(Country),Craft,Launch Date,Crew,Mission Highlights
1,Vostok-1(USSR),Kedr (Cedar),"April 12, 1961",Gagarin,Cosmonaut Yuri Garagin became the first human ...
2,Mercury-3(USA),Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...
3,Mercury-4(USA),Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ..."
4,Vostok-2(USSR),Orel (Eagle),"August 6, 1961",Titov,Titov was the first to spend an entire day in ...

In [12]:
#Set up headers
df_mission.columns = df_mission.iloc[0]
df_mission = df_mission.drop(0)

#Delete "(Country)" from first column header
df_mission = df_mission.rename(columns={"Mission(Country)":"Mission"})

#Delete all rows with "(USSR)" in Mission name
df_mission = df_mission[~df_mission['Mission'].str.contains('(USSR)')]

df_mission.head()

C:\Users\Asha\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  if __name__ == '__main__':

,Mission,Craft,Launch Date,Crew,Mission Highlights
2,Mercury-3(USA),Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...
3,Mercury-4(USA),Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ..."
5,Mercury-6(USA),Friendship 7,"February 20,1962",Glenn,The first US manned orbital flight at an orbit...
6,Mercury-7(USA),Aurora 7,"May 24, 1962",Carpenter,The second US manned orbital flight which orbi...
9,Mercury-8(USA),Sigma 7,"October 3, 1962",Schirra,Walter Schirra orbited the Earth six times dur...

In [13]:
# Rename Craft field to more accurately describe ship name
df_mission.rename(columns={"Craft":"Given Craft Name"},inplace=True)

In [14]:
#Split spacecraft model from Mission name 
def split_craft(craft_string):
#     if "-" in craft_string:
#         craft_name = craft_string.split('-')[0]
#     else:
    craft_name = craft_string.split()[0]
    return(craft_name)
        
# def split_last(astro_string):
#     if "." in astro_string:
#         last_name = astro_string.split('.')[1]
#         last_name = last_name.strip()
#     else:
#         last_name = astro_string.split()[1]
#     return(last_name)

#Assign to new columns
df_mission['Craft Model'] = df_mission['Given Craft Name'].apply(split_craft)
df_mission

,Mission,Given Craft Name,Launch Date,Crew,Mission Highlights,Craft Model
2,Mercury-3(USA),Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...,Freedom
3,Mercury-4(USA),Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ...",Liberty
5,Mercury-6(USA),Friendship 7,"February 20,1962",Glenn,The first US manned orbital flight at an orbit...,Friendship
6,Mercury-7(USA),Aurora 7,"May 24, 1962",Carpenter,The second US manned orbital flight which orbi...,Aurora
9,Mercury-8(USA),Sigma 7,"October 3, 1962",Schirra,Walter Schirra orbited the Earth six times dur...,Sigma
10,Mercury 9(USA),Faith 7,"May 15, 1963",Cooper,Cooper pilots the longest and last Mercury mis...,Faith
15,Gemini-Titan 3(USA),Molly Brown,"March 23, 1965",GrissomYoung,"Starting the Gemini program, this spacecraft w...",Molly
16,Gemini-Titan 4(USA),Gemini 4,"June 3, 1965",McDivittWhite,This mission set a four-day endurance record. ...,Gemini
17,Gemini-Titan 5(USA),Gemini 5,"August 21, 1965",Cooper Conrad,Cooper and Conrad set the world endurance reco...,Gemini
18,Gemini-Titan 7(USA),Gemini 7,"December 4, 1965",Borman Lovell,This mission set yet another endurance record ...,Gemini
19,Gemini-Titan 6-A(USA),Gemini 6,"December 15,1965",SchirraStafford,Gemini 6 rendezvoused with Gemini 7 coming wit...,Gemini
20,Gemini-Titan 8(USA),Gemini 8,"March 16,1966",Armstrong Scott,Armstrong and Scott perform the first docking ...,Gemini
21,Gemini-Titan 9-A(USA),Gemini 9,"June 3,1966",Stafford Cernan,Gemini 9 rendezvoused with the Augmented Targe...,Gemini
22,Gemini-Titan 10(USA),Gemini 10,"July 18,1966",Young Collins,Gemini 10 reached a record altitude of 468 mil...,Gemini
23,Gemini-Titan 11(USA),Gemini 11,"September 12, 1966",Conrad Gordon,Gemini made the first American autopilot reent...,Gemini
24,Gemini-Titan 12(USA),Gemini 12,"November 11, 1966",Lovell Aldrin,"In this last Gemini mission, Aldrin made three...",Gemini
25,Apollo-Saturn 204(USA),Apollo 1,"January 27, 1967",GrissomWhite Chaffee,While training for a fourteen-day mission sche...,Apollo
27,Apollo-Saturn 7(USA),Apollo 7,"October 11, 1968",Schirra Eisele Cunningham,The Apollo spacecraft makes its first flight a...,Apollo
29,Apollo-Saturn 8(USA),Apollo 8,"December 21, 1968",",Borman Lovell Anders",This Saturn 5 rocket sent the astronauts to th...,Apollo
32,Apollo-Saturn 9(USA),Apollo 9cm: Gumdroplm: Spider,"March 3, 1969",McDivitt Scott Schweickart,McDivitt and Schweickart made the first manned...,Apollo
33,Apollo-Saturn 10(USA),Apollo 10cm: Charlie Brownlm: Snoopy,"May 18, 1969",Stafford Young Cernan,This mission was a dress rehearsal for a lunar...,Apollo
34,Apollo-Saturn 11(USA),Apollo 11cm: Columbialm: Eagle,"July 16, 1969",Armstrong Collins Aldrin,Apollo 11 successfully completed the first man...,Apollo
38,Apollo-Saturn 12(USA),Apollo 12cm: Yankee Clipperlm: Intrepid,"November 14, 1969",Conrad Gordon Bean,Apollo 12 made the second landing on the moon....,Apollo
39,Apollo-Saturn 13(USA),Apollo 13cm: Odysseylm: Aquarius,"April 11, 1970",Lovell Swigert Haise,The third manned lunar landing was aborted due...,Apollo
41,Apollo-Saturn 14(USA),Apollo 14cm: Kitty Hawklm: Antares,"January 31, 1971",Shepard Roosa Mitchell,Apollo 14 was the third successful lunar landi...,Apollo
44,Apollo-Saturn 15(USA),Apollo 15cm: Endeavourlm: Falcon,"July 26, 1971",Scott Worden Irwin,Scott and Irwin became the first astronauts to...,Apollo
45,Apollo-Saturn 16(USA),Apollo 16cm: Casperlm: Orion,"April 16, 1972",Young Mattingly Duke,Young and Duke visited the previously unexplor...,Apollo
46,Apollo-Saturn 17(USA),Apollo 17cm: Challengerlm: America,"December 7, 1972",Cernan Evans Schmitt,Apollo 17 was the last lunar landing mission. ...,Apollo
47,Skylab SL-2(USA),Skylab,"May 25, 1973",Conrad Kerwin Weitz,"The first American laboratory in space, Skylab...",Skylab
48,Skylab SL-3(USA),Skylab,"July 23, 1973",Bean Garriott Lousma,These astronauts became the second crew of Sky...,Skylab
...,...,...,...,...,...,...
94,41-C(USA),Challenger,"April 6, 1984",Crippen Scobee Hart van Hoften Nelson,"This mission accomplished the first capture, r...",Challenger
96,41-D(USA),Discovery,"August 30, 1984",Hartsfield Coats Mullane Hawley Resnik Walker,First flight of the Shuttle Discovery. The Con...,Discovery
97,41-G(USA),Challenger,"October 5, 1984",Crippen McBride Sullivan Ride Leestma Scully-P...,First crew of seven. The astronauts deployed t...,Challenger
98,51-A(USA),Discovery,"November 8, 1984",Hauck Walker Allen Fisher Gardner,Two new satellites were launched and two broke...,Discovery
99,51-C(USA),Discovery,"January 24, 1985",Mattingly Shriver Onizuka Buchli Payton,The first classified U.S. Department of Defens...,Discovery
100,51-D(USA),Discovery,"April 12, 1985",Bobko Williams Seddon Griggs Hoffman Walker Garn,This mission deployed a communications satellite.,Discovery
101,51-B(USA),"Challenger, Spacelab","April 29, 1985",Overmyer Gregory Lind Thagard Thornton Wang va...,"Spacelab 3, the first life sciences and space ...","Challenger,"
103,51-G(USA),Discovery,"June 17, 1985",Brandenstein Creighton Fabian Nagel Lucid Baud...,The first tri-national space crew deployed thr...,Discovery
104,51-F(USA),"Challenger, Spacelab","July 29, 1985",Fullerton Bridges Henize Musgrave England Acto...,Spacelab 2 carried experiments in life science...,"Challenger,"
105,51-I(USA),Discovery,"August 27, 1985",Engle Covey van Hoften Lounge Fisher,"The astronauts deployed two satellites, then r...",Discovery
107,51-J(USA),Atlantis,"October 3, 1985",Bobko Grabe Hilmers Stewart Pailes,The first flight of Shuttle Atlantis was the s...,Atlantis
108,61-A(USA),"Challenger, Spacelab D1","October 30, 1985",Hartsfield Nagel Dunbar Buchli Bluford Furrer ...,Spacelab D1 was controlled by the West German ...,"Challenger,"
109,61-B(USA),Atlantis,"November 26, 1985",Shaw O'Connor Ross Cleave Spring Walker Neri Vela,The crew of Mission 61-B tested space construc...,Atlantis
110,61-C(USA),Columbia,"January 12, 1986",Gibson Bolden Nelson Hawley Chang-Diaz Cenker,This mission had lots of problems and had to b...,Columbia
111,51-L(USA),Challenger,"January 28, 1986",Scobee Smith Onizuka Resnik McNair Jarvis McAu...,All seven crew members were killed when Challe...,Challenger
118,STS-26(USA),Discovery,"September 29, 1988",Hauck Covey Lounge Hilmers Nelson,The Shuttle program's return to flight after t...,Discovery
120,STS-27(USA),Atlantis,"December 2, 1988",Gibson Gardner Mullane Ross Shepherd,The third classified Department of Defense Shu...,Atlantis
121,STS-29(USA),Discovery,"March 13, 1989",Coats Blaha Buchli Springer Bagian,This mission deployed the third tracking and d...,Discovery
122,STS-30(USA),Atlantis,"May 4, 1989",Walker Grabe Thagard Cleave Lee,Deployed the radar mapping space probe Magella...,Atlantis
123,STS-28(USA),Columbia,"August 13, 1989",Shaw Richards Leestma Adamson Brown,The fourth classified Department of Defense Sh...,Columbia
125,STS-34(USA),Atlantis,"October 18, 1989",Williams McCulley Lucid Chang-Diaz Baker,"Deployed the space probe Galileo, sending it o...",Atlantis
126,STS-33(USA),Discovery,"November 22, 1989",Gregory Blaha Carter Musgrave Thornton,The fifth Department of Defense Shuttle mission.,Discovery
127,STS-32(USA),Columbia,"January 9, 1990",Brandenstein Wetherbee Dunbar Ivins Low,This Shuttle mission deployed the Syncom IV-5 ...,Columbia
129,STS-36(USA),Atlantis,"February 28, 1990",Creighton Casper Hilmers Mullane Thuot,The sixth classified Department of Defense Shu...,Atlantis
130,STS-31(USA),Discovery,"April 24, 1990",Shriver Bolden McCandless Hawley Sullivan,Deployed the Hubble Space Telescope.,Discovery
132,STS-41(USA),Discovery,"October 6, 1990",Richards Cabana Melnick Shepherd Akers,"Deployed the Ulysses space probe, sending it o...",Discovery
133,STS-38(USA),Atlantis,"November 15, 1990",Covey Culbertson Springer Meade Gemar,The last classified Department of Defense Shut...,Atlantis
134,STS-35(USA),Columbia,"December 2, 1990",Brand Gardner Hoffman Lounge Parker,This Spacelab mission performed astronomical e...,Columbia
136,STS-37(USA),Atlantis,"April 5, 1991",Nagel Cameron Godwin Ross Apt,Deployed the Gamma Ray Observatory.,Atlantis
137,STS-39(USA),Discovery,"April 28,1991",Coats Hammond Harbaugh McMonagle Bluford Veach...,This unclassified Department of Defense Shuttl...,Discovery

In [15]:
#Mission id assigning
def assign_mission_id(item):
    result = "M-"+str(uuid.uuid4().fields[-1])[:5]
    return(result)
df_mission["Mission ID"] = df_mission["Mission"].apply(assign_mission_id)

id_column = df_mission.pop('Mission ID')
df_mission.insert(0, id_column.name, id_column)
df_mission

,Mission ID,Mission,Given Craft Name,Launch Date,Crew,Mission Highlights,Craft Model
2,M-14469,Mercury-3(USA),Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...,Freedom
3,M-10093,Mercury-4(USA),Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ...",Liberty
5,M-77477,Mercury-6(USA),Friendship 7,"February 20,1962",Glenn,The first US manned orbital flight at an orbit...,Friendship
6,M-22015,Mercury-7(USA),Aurora 7,"May 24, 1962",Carpenter,The second US manned orbital flight which orbi...,Aurora
9,M-23717,Mercury-8(USA),Sigma 7,"October 3, 1962",Schirra,Walter Schirra orbited the Earth six times dur...,Sigma
10,M-26425,Mercury 9(USA),Faith 7,"May 15, 1963",Cooper,Cooper pilots the longest and last Mercury mis...,Faith
15,M-14189,Gemini-Titan 3(USA),Molly Brown,"March 23, 1965",GrissomYoung,"Starting the Gemini program, this spacecraft w...",Molly
16,M-79354,Gemini-Titan 4(USA),Gemini 4,"June 3, 1965",McDivittWhite,This mission set a four-day endurance record. ...,Gemini
17,M-13645,Gemini-Titan 5(USA),Gemini 5,"August 21, 1965",Cooper Conrad,Cooper and Conrad set the world endurance reco...,Gemini
18,M-23497,Gemini-Titan 7(USA),Gemini 7,"December 4, 1965",Borman Lovell,This mission set yet another endurance record ...,Gemini
19,M-25688,Gemini-Titan 6-A(USA),Gemini 6,"December 15,1965",SchirraStafford,Gemini 6 rendezvoused with Gemini 7 coming wit...,Gemini
20,M-25432,Gemini-Titan 8(USA),Gemini 8,"March 16,1966",Armstrong Scott,Armstrong and Scott perform the first docking ...,Gemini
21,M-82798,Gemini-Titan 9-A(USA),Gemini 9,"June 3,1966",Stafford Cernan,Gemini 9 rendezvoused with the Augmented Targe...,Gemini
22,M-14071,Gemini-Titan 10(USA),Gemini 10,"July 18,1966",Young Collins,Gemini 10 reached a record altitude of 468 mil...,Gemini
23,M-18924,Gemini-Titan 11(USA),Gemini 11,"September 12, 1966",Conrad Gordon,Gemini made the first American autopilot reent...,Gemini
24,M-95275,Gemini-Titan 12(USA),Gemini 12,"November 11, 1966",Lovell Aldrin,"In this last Gemini mission, Aldrin made three...",Gemini
25,M-23868,Apollo-Saturn 204(USA),Apollo 1,"January 27, 1967",GrissomWhite Chaffee,While training for a fourteen-day mission sche...,Apollo
27,M-14056,Apollo-Saturn 7(USA),Apollo 7,"October 11, 1968",Schirra Eisele Cunningham,The Apollo spacecraft makes its first flight a...,Apollo
29,M-19951,Apollo-Saturn 8(USA),Apollo 8,"December 21, 1968",",Borman Lovell Anders",This Saturn 5 rocket sent the astronauts to th...,Apollo
32,M-14696,Apollo-Saturn 9(USA),Apollo 9cm: Gumdroplm: Spider,"March 3, 1969",McDivitt Scott Schweickart,McDivitt and Schweickart made the first manned...,Apollo
33,M-10205,Apollo-Saturn 10(USA),Apollo 10cm: Charlie Brownlm: Snoopy,"May 18, 1969",Stafford Young Cernan,This mission was a dress rehearsal for a lunar...,Apollo
34,M-39898,Apollo-Saturn 11(USA),Apollo 11cm: Columbialm: Eagle,"July 16, 1969",Armstrong Collins Aldrin,Apollo 11 successfully completed the first man...,Apollo
38,M-24600,Apollo-Saturn 12(USA),Apollo 12cm: Yankee Clipperlm: Intrepid,"November 14, 1969",Conrad Gordon Bean,Apollo 12 made the second landing on the moon....,Apollo
39,M-25979,Apollo-Saturn 13(USA),Apollo 13cm: Odysseylm: Aquarius,"April 11, 1970",Lovell Swigert Haise,The third manned lunar landing was aborted due...,Apollo
41,M-77791,Apollo-Saturn 14(USA),Apollo 14cm: Kitty Hawklm: Antares,"January 31, 1971",Shepard Roosa Mitchell,Apollo 14 was the third successful lunar landi...,Apollo
44,M-21155,Apollo-Saturn 15(USA),Apollo 15cm: Endeavourlm: Falcon,"July 26, 1971",Scott Worden Irwin,Scott and Irwin became the first astronauts to...,Apollo
45,M-21659,Apollo-Saturn 16(USA),Apollo 16cm: Casperlm: Orion,"April 16, 1972",Young Mattingly Duke,Young and Duke visited the previously unexplor...,Apollo
46,M-11991,Apollo-Saturn 17(USA),Apollo 17cm: Challengerlm: America,"December 7, 1972",Cernan Evans Schmitt,Apollo 17 was the last lunar landing mission. ...,Apollo
47,M-23204,Skylab SL-2(USA),Skylab,"May 25, 1973",Conrad Kerwin Weitz,"The first American laboratory in space, Skylab...",Skylab
48,M-25075,Skylab SL-3(USA),Skylab,"July 23, 1973",Bean Garriott Lousma,These astronauts became the second crew of Sky...,Skylab
...,...,...,...,...,...,...,...
94,M-85349,41-C(USA),Challenger,"April 6, 1984",Crippen Scobee Hart van Hoften Nelson,"This mission accomplished the first capture, r...",Challenger
96,M-48283,41-D(USA),Discovery,"August 30, 1984",Hartsfield Coats Mullane Hawley Resnik Walker,First flight of the Shuttle Discovery. The Con...,Discovery
97,M-68422,41-G(USA),Challenger,"October 5, 1984",Crippen McBride Sullivan Ride Leestma Scully-P...,First crew of seven. The astronauts deployed t...,Challenger
98,M-22848,51-A(USA),Discovery,"November 8, 1984",Hauck Walker Allen Fisher Gardner,Two new satellites were launched and two broke...,Discovery
99,M-42943,51-C(USA),Discovery,"January 24, 1985",Mattingly Shriver Onizuka Buchli Payton,The first classified U.S. Department of Defens...,Discovery
100,M-17193,51-D(USA),Discovery,"April 12, 1985",Bobko Williams Seddon Griggs Hoffman Walker Garn,This mission deployed a communications satellite.,Discovery
101,M-15626,51-B(USA),"Challenger, Spacelab","April 29, 1985",Overmyer Gregory Lind Thagard Thornton Wang va...,"Spacelab 3, the first life sciences and space ...","Challenger,"
103,M-15753,51-G(USA),Discovery,"June 17, 1985",Brandenstein Creighton Fabian Nagel Lucid Baud...,The first tri-national space crew deployed thr...,Discovery
104,M-74321,51-F(USA),"Challenger, Spacelab","July 29, 1985",Fullerton Bridges Henize Musgrave England Acto...,Spacelab 2 carried experiments in life science...,"Challenger,"
105,M-68756,51-I(USA),Discovery,"August 27, 1985",Engle Covey van Hoften Lounge Fisher,"The astronauts deployed two satellites, then r...",Discovery
107,M-93848,51-J(USA),Atlantis,"October 3, 1985",Bobko Grabe Hilmers Stewart Pailes,The first flight of Shuttle Atlantis was the s...,Atlantis
108,M-10763,61-A(USA),"Challenger, Spacelab D1","October 30, 1985",Hartsfield Nagel Dunbar Buchli Bluford Furrer ...,Spacelab D1 was controlled by the West German ...,"Challenger,"
109,M-21493,61-B(USA),Atlantis,"November 26, 1985",Shaw O'Connor Ross Cleave Spring Walker Neri Vela,The crew of Mission 61-B tested space construc...,Atlantis
110,M-17792,61-C(USA),Columbia,"January 12, 1986",Gibson Bolden Nelson Hawley Chang-Diaz Cenker,This mission had lots of problems and had to b...,Columbia
111,M-14146,51-L(USA),Challenger,"January 28, 1986",Scobee Smith Onizuka Resnik McNair Jarvis McAu...,All seven crew members were killed when Challe...,Challenger
118,M-49988,STS-26(USA),Discovery,"September 29, 1988",Hauck Covey Lounge Hilmers Nelson,The Shuttle program's return to flight after t...,Discovery
120,M-82816,STS-27(USA),Atlantis,"December 2, 1988",Gibson Gardner Mullane Ross Shepherd,The third classified Department of Defense Shu...,Atlantis
121,M-84164,STS-29(USA),Discovery,"March 13, 1989",Coats Blaha Buchli Springer Bagian,This mission deployed the third tracking and d...,Discovery
122,M-16548,STS-30(USA),Atlantis,"May 4, 1989",Walker Grabe Thagard Cleave Lee,Deployed the radar mapping space probe Magella...,Atlantis
123,M-10911,STS-28(USA),Columbia,"August 13, 1989",Shaw Richards Leestma Adamson Brown,The fourth classified Department of Defense Sh...,Columbia
125,M-16385,STS-34(USA),Atlantis,"October 18, 1989",Williams McCulley Lucid Chang-Diaz Baker,"Deployed the space probe Galileo, sending it o...",Atlantis
126,M-16122,STS-33(USA),Discovery,"November 22, 1989",Gregory Blaha Carter Musgrave Thornton,The fifth Department of Defense Shuttle mission.,Discovery
127,M-10476,STS-32(USA),Columbia,"January 9, 1990",Brandenstein Wetherbee Dunbar Ivins Low,This Shuttle mission deployed the Syncom IV-5 ...,Columbia
129,M-16920,STS-36(USA),Atlantis,"February 28, 1990",Creighton Casper Hilmers Mullane Thuot,The sixth classified Department of Defense Shu...,Atlantis
130,M-79755,STS-31(USA),Discovery,"April 24, 1990",Shriver Bolden McCandless Hawley Sullivan,Deployed the Hubble Space Telescope.,Discovery
132,M-19404,STS-41(USA),Discovery,"October 6, 1990",Richards Cabana Melnick Shepherd Akers,"Deployed the Ulysses space probe, sending it o...",Discovery
133,M-59039,STS-38(USA),Atlantis,"November 15, 1990",Covey Culbertson Springer Meade Gemar,The last classified Department of Defense Shut...,Atlantis
134,M-24776,STS-35(USA),Columbia,"December 2, 1990",Brand Gardner Hoffman Lounge Parker,This Spacelab mission performed astronomical e...,Columbia
136,M-16823,STS-37(USA),Atlantis,"April 5, 1991",Nagel Cameron Godwin Ross Apt,Deployed the Gamma Ray Observatory.,Atlantis
137,M-30002,STS-39(USA),Discovery,"April 28,1991",Coats Hammond Harbaugh McMonagle Bluford Veach...,This unclassified Department of Defense Shuttl...,Discovery

In [16]:
#Reset Index
df_mission = df_mission.reset_index(drop=True)
df_mission.head()

,Mission ID,Mission,Given Craft Name,Launch Date,Crew,Mission Highlights,Craft Model
0,M-14469,Mercury-3(USA),Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...,Freedom
1,M-10093,Mercury-4(USA),Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ...",Liberty
2,M-77477,Mercury-6(USA),Friendship 7,"February 20,1962",Glenn,The first US manned orbital flight at an orbit...,Friendship
3,M-22015,Mercury-7(USA),Aurora 7,"May 24, 1962",Carpenter,The second US manned orbital flight which orbi...,Aurora
4,M-23717,Mercury-8(USA),Sigma 7,"October 3, 1962",Schirra,Walter Schirra orbited the Earth six times dur...,Sigma

In [17]:
#Delete country naming
def remove_usa(name):
    result = name.split('(')[0]
    return(result)

df_mission['Mission'] = df_mission["Mission"].apply(remove_usa)
df_mission.head()

,Mission ID,Mission,Given Craft Name,Launch Date,Crew,Mission Highlights,Craft Model
0,M-14469,Mercury-3,Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...,Freedom
1,M-10093,Mercury-4,Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ...",Liberty
2,M-77477,Mercury-6,Friendship 7,"February 20,1962",Glenn,The first US manned orbital flight at an orbit...,Friendship
3,M-22015,Mercury-7,Aurora 7,"May 24, 1962",Carpenter,The second US manned orbital flight which orbi...,Aurora
4,M-23717,Mercury-8,Sigma 7,"October 3, 1962",Schirra,Walter Schirra orbited the Earth six times dur...,Sigma

In [18]:
#Splitting df for id and joining purposes
join_df = df_mission

mission_df=df_mission.drop(["Crew"], axis=1)
mission_df.head()

,Mission ID,Mission,Given Craft Name,Launch Date,Mission Highlights,Craft Model
0,M-14469,Mercury-3,Freedom 7,"May 5, 1961",Alan Shepard became the first American in spac...,Freedom
1,M-10093,Mercury-4,Liberty Bell-7,"July 21, 1961","The second US sub-orbital flight, reaching an ...",Liberty
2,M-77477,Mercury-6,Friendship 7,"February 20,1962",The first US manned orbital flight at an orbit...,Friendship
3,M-22015,Mercury-7,Aurora 7,"May 24, 1962",The second US manned orbital flight which orbi...,Aurora
4,M-23717,Mercury-8,Sigma 7,"October 3, 1962",Walter Schirra orbited the Earth six times dur...,Sigma

In [19]:
#Remove leading characters and commas from crew column (currently they are only leading, not deliminating)
join_df['Crew'] = join_df['Crew'].str.strip(',')
join_df.head()

,Mission ID,Mission,Given Craft Name,Launch Date,Crew,Mission Highlights,Craft Model
0,M-14469,Mercury-3,Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...,Freedom
1,M-10093,Mercury-4,Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ...",Liberty
2,M-77477,Mercury-6,Friendship 7,"February 20,1962",Glenn,The first US manned orbital flight at an orbit...,Friendship
3,M-22015,Mercury-7,Aurora 7,"May 24, 1962",Carpenter,The second US manned orbital flight which orbi...,Aurora
4,M-23717,Mercury-8,Sigma 7,"October 3, 1962",Schirra,Walter Schirra orbited the Earth six times dur...,Sigma

In [20]:
#Split names for sorting
def split_it(crew_string):
    result = re.sub(r"(\w)([A-Z])", r"\1 \2", crew_string)

    if 'Mac' in result:
        result = result.replace("Mac ", "Mac")
    
    if "Mc" in result:
        result = result.replace("Mc ", "Mc")
        
    if "van den Berg" in result:
        result = "vandenBerg"
    
    if "van Hoften" in result:
        result = "vanHoften"

    return(result)

join_df['Crew'] = join_df['Crew'].apply(split_it)
join_df.head()

,Mission ID,Mission,Given Craft Name,Launch Date,Crew,Mission Highlights,Craft Model
0,M-14469,Mercury-3,Freedom 7,"May 5, 1961",Shepard,Alan Shepard became the first American in spac...,Freedom
1,M-10093,Mercury-4,Liberty Bell-7,"July 21, 1961",Grissom,"The second US sub-orbital flight, reaching an ...",Liberty
2,M-77477,Mercury-6,Friendship 7,"February 20,1962",Glenn,The first US manned orbital flight at an orbit...,Friendship
3,M-22015,Mercury-7,Aurora 7,"May 24, 1962",Carpenter,The second US manned orbital flight which orbi...,Aurora
4,M-23717,Mercury-8,Sigma 7,"October 3, 1962",Schirra,Walter Schirra orbited the Earth six times dur...,Sigma

In [21]:
#Move Crew column to second column
my_column = join_df.pop('Crew')
join_df.insert(2, my_column.name, my_column)
join_df.head()

,Mission ID,Mission,Crew,Given Craft Name,Launch Date,Mission Highlights,Craft Model
0,M-14469,Mercury-3,Shepard,Freedom 7,"May 5, 1961",Alan Shepard became the first American in spac...,Freedom
1,M-10093,Mercury-4,Grissom,Liberty Bell-7,"July 21, 1961","The second US sub-orbital flight, reaching an ...",Liberty
2,M-77477,Mercury-6,Glenn,Friendship 7,"February 20,1962",The first US manned orbital flight at an orbit...,Friendship
3,M-22015,Mercury-7,Carpenter,Aurora 7,"May 24, 1962",The second US manned orbital flight which orbi...,Aurora
4,M-23717,Mercury-8,Schirra,Sigma 7,"October 3, 1962",Walter Schirra orbited the Earth six times dur...,Sigma

In [22]:
#Setting up name split per mission
df_join = pd.DataFrame(columns=join_df.columns)
df_join

#Iterate over df in order to create new df, split names appropriately so each crew member is seperate
for index, row in join_df.iterrows():
    check = row["Crew"].split(" ")
    
    for name in check:
        missionid = row["Mission ID"]
        mission = row["Mission"]
        craft = row["Given Craft Name"]
        launchdate= row["Launch Date"]
        missionhighlights = row["Mission Highlights"]
        model = row["Craft Model"]
        simp_df = pd.DataFrame([[missionid, mission, name, craft, launchdate, missionhighlights,model]], columns=df_join.columns)
        df_join = df_join.append(simp_df)

#Apply sort based on Crew Member's Last Name
df_join = df_join.sort_values(by=["Mission"])

#Reset index
df_join = df_join.reset_index(drop=True)

df_join.head()

,Mission ID,Mission,Crew,Given Craft Name,Launch Date,Mission Highlights,Craft Model
0,M-10478,41-B,Brand,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
1,M-10478,41-B,Gibson,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
2,M-10478,41-B,McNair,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
3,M-10478,41-B,Stewart,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
4,M-10478,41-B,McCandless,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger

In [23]:
#Final Name fix for the "van" leaders
def fix_name(crew_name):
    if "vandenBerg" in crew_name:
        name = "van den Berg"  
    elif "vanHoften" in crew_name:
        name = "van Hoften"
    else:
        name = crew_name
        
    return(name)

df_join['Crew'] = df_join['Crew'].apply(fix_name)
df_join

,Mission ID,Mission,Crew,Given Craft Name,Launch Date,Mission Highlights,Craft Model
0,M-10478,41-B,Brand,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
1,M-10478,41-B,Gibson,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
2,M-10478,41-B,McNair,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
3,M-10478,41-B,Stewart,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
4,M-10478,41-B,McCandless,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger
5,M-85349,41-C,van Hoften,Challenger,"April 6, 1984","This mission accomplished the first capture, r...",Challenger
6,M-48283,41-D,Mullane,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery
7,M-48283,41-D,Hawley,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery
8,M-48283,41-D,Coats,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery
9,M-48283,41-D,Hartsfield,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery
10,M-48283,41-D,Resnik,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery
11,M-48283,41-D,Walker,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery
12,M-68422,41-G,Crippen,Challenger,"October 5, 1984",First crew of seven. The astronauts deployed t...,Challenger
13,M-68422,41-G,Scully-Power,Challenger,"October 5, 1984",First crew of seven. The astronauts deployed t...,Challenger
14,M-68422,41-G,Sullivan,Challenger,"October 5, 1984",First crew of seven. The astronauts deployed t...,Challenger
15,M-68422,41-G,Ride,Challenger,"October 5, 1984",First crew of seven. The astronauts deployed t...,Challenger
16,M-68422,41-G,Leestma,Challenger,"October 5, 1984",First crew of seven. The astronauts deployed t...,Challenger
17,M-68422,41-G,Garneau,Challenger,"October 5, 1984",First crew of seven. The astronauts deployed t...,Challenger
18,M-68422,41-G,McBride,Challenger,"October 5, 1984",First crew of seven. The astronauts deployed t...,Challenger
19,M-22848,51-A,Walker,Discovery,"November 8, 1984",Two new satellites were launched and two broke...,Discovery
20,M-22848,51-A,Allen,Discovery,"November 8, 1984",Two new satellites were launched and two broke...,Discovery
21,M-22848,51-A,Fisher,Discovery,"November 8, 1984",Two new satellites were launched and two broke...,Discovery
22,M-22848,51-A,Hauck,Discovery,"November 8, 1984",Two new satellites were launched and two broke...,Discovery
23,M-22848,51-A,Gardner,Discovery,"November 8, 1984",Two new satellites were launched and two broke...,Discovery
24,M-15626,51-B,van den Berg,"Challenger, Spacelab","April 29, 1985","Spacelab 3, the first life sciences and space ...","Challenger,"
25,M-42943,51-C,Mattingly,Discovery,"January 24, 1985",The first classified U.S. Department of Defens...,Discovery
26,M-42943,51-C,Shriver,Discovery,"January 24, 1985",The first classified U.S. Department of Defens...,Discovery
27,M-42943,51-C,Onizuka,Discovery,"January 24, 1985",The first classified U.S. Department of Defens...,Discovery
28,M-42943,51-C,Buchli,Discovery,"January 24, 1985",The first classified U.S. Department of Defens...,Discovery
29,M-42943,51-C,Payton,Discovery,"January 24, 1985",The first classified U.S. Department of Defens...,Discovery
...,...,...,...,...,...,...,...
237,M-41515,STS-6,Peterson,Challenger,"April 4, 1983",First flight of Shuttle Challenger. The first ...,Challenger
238,M-41515,STS-6,Musgrave,Challenger,"April 4, 1983",First flight of Shuttle Challenger. The first ...,Challenger
239,M-41515,STS-6,Bobko,Challenger,"April 4, 1983",First flight of Shuttle Challenger. The first ...,Challenger
240,M-41515,STS-6,Karol,Challenger,"April 4, 1983",First flight of Shuttle Challenger. The first ...,Challenger
241,M-41515,STS-6,Weitz,Challenger,"April 4, 1983",First flight of Shuttle Challenger. The first ...,Challenger
242,M-51523,STS-7,Crippen,Challenger,"June 18, 1983",Ride became the first American woman to make a...,Challenger
243,M-51523,STS-7,Hauck,Challenger,"June 18, 1983",Ride became the first American woman to make a...,Challenger
244,M-51523,STS-7,Fabian,Challenger,"June 18, 1983",Ride became the first American woman to make a...,Challenger
245,M-51523,STS-7,Ride,Challenger,"June 18, 1983",Ride became the first American woman to make a...,Challenger
246,M-51523,STS-7,Thagard,Challenger,"June 18, 1983",Ride became the first American woman to make a...,Challenger
247,M-18168,STS-8,Bluford,Challenger,"April 30, 1983",Bluford became the first African-American to g...,Challenger
248,M-18168,STS-8,Gardner,Challenger,"April 30, 1983",Bluford became the first African-American to g...,Challenger
249,M-18168,STS-8,Thornton,Challenger,"April 30, 1983",Bluford became the first African-American to g...,Challenger
250,M-18168,STS-8,Truly,Challenger,"April 30, 1983",Bluford became the first African-American to g...,Challenger
251,M-18168,STS-8,Brandenstein,Challenger,"April 30, 1983",Bluford became the first African-American to g...,Challenger
252,M-40854,STS-9,Young,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,"
253,M-40854,STS-9,Shaw,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,"
254,M-40854,STS-9,Garriott,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,"
255,M-40854,STS-9,Parker,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,"
256,M-40854,STS-9,Lichtenberg,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,"
257,M-40854,STS-9,Merbold,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,"
258,M-23204,Skylab SL-2,Weitz,Skylab,"May 25, 1973","The first American laboratory in space, Skylab...",Skylab
259,M-23204,Skylab SL-2,Kerwin,Skylab,"May 25, 1973","The first American laboratory in space, Skylab...",Skylab
260,M-23204,Skylab SL-2,Conrad,Skylab,"May 25, 1973","The first American laboratory in space, Skylab...",Skylab
261,M-25075,Skylab SL-3,Lousma,Skylab,"July 23, 1973",These astronauts became the second crew of Sky...,Skylab
262,M-25075,Skylab SL-3,Garriott,Skylab,"July 23, 1973",These astronauts became the second crew of Sky...,Skylab
263,M-25075,Skylab SL-3,Bean,Skylab,"July 23, 1973",These astronauts became the second crew of Sky...,Skylab
264,M-21096,Skylab SL-4,Gibson,Skylab,"November 15, 1973",These astronauts became the final crew of Skyl...,Skylab
265,M-21096,Skylab SL-4,Carr,Skylab,"November 15, 1973",These astronauts became the final crew of Skyl...,Skylab
266,M-21096,Skylab SL-4,Pogue,Skylab,"November 15, 1973",These astronauts became the final crew of Skyl...,Skylab

# Spaceship Cleanup

In [24]:
# Used Pandas to retrieve data from table in html rather than BeautifulSoup
# First table of Orbital crewed spaceship
df1 = (pd.read_html('https://en.wikipedia.org/wiki/Comparison_of_crewed_space_vehicles'))[1]
df1.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Generatedpower (W),Firstspaceflight*,Lastspaceflight,Flights*
1,SpaceShipOne,USA,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3[note 18]
2,X-15,USA,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2[note 19]
3,New Shepard,USA,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019(2015),NaN,0 (10)[note 19]
4,SpaceShipTwo,USA,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8[note 20],18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2[note 21]

In [25]:
# Gets first row as a list to use as new header
header_1 = df1.iloc[0]
header_1

0             Spacecraft
1                 Origin
2           Manufacturer
3                  Range
4           Launchsystem
5               Crewsize
6             Length (m)
7           Diameter (m)
8       Launch mass (kg)
9            Powersystem
10    Generatedpower (W)
11     Firstspaceflight*
12       Lastspaceflight
13              Flights*
Name: 0, dtype: object

In [26]:
#Rename columns for proper labels
df1.rename(columns=header_1, inplace=True)
df1.head()

,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Generatedpower (W),Firstspaceflight*,Lastspaceflight,Flights*
0,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Generatedpower (W),Firstspaceflight*,Lastspaceflight,Flights*
1,SpaceShipOne,USA,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3[note 18]
2,X-15,USA,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2[note 19]
3,New Shepard,USA,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019(2015),NaN,0 (10)[note 19]
4,SpaceShipTwo,USA,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8[note 20],18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2[note 21]

In [27]:
# Add orbital type that separates table subjects
df1['Orbit'] = "Orbital"

In [28]:
# Second table of Sub-orbital crewed spaceship
df2 = (pd.read_html('https://en.wikipedia.org/wiki/Comparison_of_crewed_space_vehicles'))[0]
df2.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Payloadto/from ISS (kg),Firstspaceflight*,Lastspaceflight,Flights*
1,Mercury,USA,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961 (1960),1963,6(12)[note 1]
2,Gemini,USA,McDonnell AircraftMartin,LEO,Titan II GLVTitan IIIC[note 2],2,5.56,3.05,NaN,Fuel cells,NaN,1965 (1964),1966,10(2)[note 3]
3,Apollo,USA,North American AviationGrumman and Douglas,Lunar,Saturn IBSaturn V,3,8.5,3.91,"5,500 CM + 14,700 LM24,500 Service Module",Fuel cells,NaN,1967 (1966),1975,15(4)[note 3]
4,Space Shuttle orbiter,USA,United Space Alliance,LEO,Space Shuttle,8[note 4],37.24,4.8[note 5],109000,Fuel cells,"12,500/16,000",1981,2011,135[note 6]

In [29]:
#Set Column names
df2 = df2.rename(columns=df2.iloc[0]).drop(df2.index[0])
df2.head()

,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Payloadto/from ISS (kg),Firstspaceflight*,Lastspaceflight,Flights*
1,Mercury,USA,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961 (1960),1963,6(12)[note 1]
2,Gemini,USA,McDonnell AircraftMartin,LEO,Titan II GLVTitan IIIC[note 2],2,5.56,3.05,NaN,Fuel cells,NaN,1965 (1964),1966,10(2)[note 3]
3,Apollo,USA,North American AviationGrumman and Douglas,Lunar,Saturn IBSaturn V,3,8.5,3.91,"5,500 CM + 14,700 LM24,500 Service Module",Fuel cells,NaN,1967 (1966),1975,15(4)[note 3]
4,Space Shuttle orbiter,USA,United Space Alliance,LEO,Space Shuttle,8[note 4],37.24,4.8[note 5],109000,Fuel cells,"12,500/16,000",1981,2011,135[note 6]
5,Orion,USA,Lockheed MartinAstrium,Mars,Delta IV HeavySpace Launch System,6,3.3,5,"8,900 Capsule12,300 Service Module",Solar Panels,NaN,Planned: 2021 (2014),NaN,0 (1)[note 7]

In [30]:
#Rename Orbit type
df2['Orbit'] = "Sub-Orbital"

In [31]:
# See which columns can be joined on
list(df1.columns)

['Spacecraft',
 'Origin',
 'Manufacturer',
 'Range',
 'Launchsystem',
 'Crewsize',
 'Length (m)',
 'Diameter (m)',
 'Launch mass (kg)',
 'Powersystem',
 'Generatedpower (W)',
 'Firstspaceflight*',
 'Lastspaceflight',
 'Flights*',
 'Orbit']

In [32]:
# See which columns can be joined on
list(df2.columns)

['Spacecraft',
 'Origin',
 'Manufacturer',
 'Range',
 'Launchsystem',
 'Crewsize',
 'Length (m)',
 'Diameter (m)',
 'Launch mass (kg)',
 'Powersystem',
 'Payloadto/from ISS (kg)',
 'Firstspaceflight*',
 'Lastspaceflight',
 'Flights*',
 'Orbit']

In [33]:
#DF Merge
df3 = df1.merge(df2,how='outer')
df3

,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Generatedpower (W),Firstspaceflight*,Lastspaceflight,Flights*,Orbit,Payloadto/from ISS (kg)
0,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Generatedpower (W),Firstspaceflight*,Lastspaceflight,Flights*,Orbital,NaN
1,SpaceShipOne,USA,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3[note 18],Orbital,NaN
2,X-15,USA,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2[note 19],Orbital,NaN
3,New Shepard,USA,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019(2015),NaN,0 (10)[note 19],Orbital,NaN
4,SpaceShipTwo,USA,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8[note 20],18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2[note 21],Orbital,NaN
5,Mercury,USA,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961 (1960),1963,6(12)[note 1],Sub-Orbital,NaN
6,Gemini,USA,McDonnell AircraftMartin,LEO,Titan II GLVTitan IIIC[note 2],2,5.56,3.05,NaN,Fuel cells,NaN,1965 (1964),1966,10(2)[note 3],Sub-Orbital,NaN
7,Apollo,USA,North American AviationGrumman and Douglas,Lunar,Saturn IBSaturn V,3,8.5,3.91,"5,500 CM + 14,700 LM24,500 Service Module",Fuel cells,NaN,1967 (1966),1975,15(4)[note 3],Sub-Orbital,NaN
8,Space Shuttle orbiter,USA,United Space Alliance,LEO,Space Shuttle,8[note 4],37.24,4.8[note 5],109000,Fuel cells,NaN,1981,2011,135[note 6],Sub-Orbital,"12,500/16,000"
9,Orion,USA,Lockheed MartinAstrium,Mars,Delta IV HeavySpace Launch System,6,3.3,5,"8,900 Capsule12,300 Service Module",Solar Panels,NaN,Planned: 2021 (2014),NaN,0 (1)[note 7],Sub-Orbital,NaN
10,Shenzhou,China,China Academy of Space Technology,LEO,Chang Zheng 2F,3,9.25,2.80,7840,Solar panels,NaN,2003 (1999),Active,7(4),Sub-Orbital,NaN
11,Gaganyaan,India,Hindustan Aeronautics Limited,LEO,GSLV Mk III,3,7,3,7800,Solar Panels,NaN,2021,NaN,0,Sub-Orbital,NaN
12,Soyuz 7K-T,Soviet Union,OKB-1,LEO,SoyuzSoyuz-U,2,7.48,2.72,NaN,Batteries,NaN,1973,1981,26 (4)[note 8],Sub-Orbital,NaN
13,Voskhod,Soviet Union,OKB-1,LEO,Voskhod,3[note 9],5,2.4,NaN,Batteries,NaN,1964 (1964),1965,2 (3),Sub-Orbital,NaN
14,Vostok,Soviet Union,OKB-1,LEOfirst,Vostok-K,1,4.4,2.43,4725,Batteries,NaN,1961 (1960),1963,6 (7)[note 10],Sub-Orbital,NaN
15,Soyuz 7K-OK,Soviet Union,OKB-1,LEO,Soyuz,3,7.48,2.72,NaN,Solar panels,NaN,1967 (1966),1970,8 (8)[note 11],Sub-Orbital,NaN
16,Soyuz 7KT-OK,Soviet Union,OKB-1,LEO,Soyuz,3,7.48,2.72,NaN,Solar panels,NaN,1971,1971,2[note 12],Sub-Orbital,NaN
17,Soyuz 7K-T-AF,Soviet Union,OKB-1,LEO,Soyuz,2,7.48,2.72,NaN,Solar panels,NaN,1973,1973,1,Sub-Orbital,NaN
18,Soyuz 7K-TM,Soviet Union,OKB-1,LEO,Soyuz-U,2,7.48,2.72,NaN,Solar panels,NaN,1974,1975,2 (2),Sub-Orbital,NaN
19,Soyuz 7K-MF6,Soviet Union,OKB-1,LEO,Soyuz-U,2,7.48,2.72,NaN,Solar panels,NaN,1976,1976,1,Sub-Orbital,NaN
20,Soyuz-T,Soviet Union,OKB-1,LEO,Soyuz-USoyuz-U2,3,7.48,2.72,NaN,Solar panels,NaN,1978,1986,15 (6)[note 13],Sub-Orbital,NaN
21,Soyuz-TM,Soviet Union Russia,RKK Energia,LEO,Soyuz-U2Soyuz-U,3,7.48,2.72,NaN,Solar panels,NaN,1986,2002,33 (1),Sub-Orbital,NaN
22,Buran,Soviet Union,RKK Energia,LEO,Energia,10,36.37,NaN,NaN,Fuel cells,NaN,(1988),(1988),(1),Sub-Orbital,NaN
23,Soyuz-TMA11F732,Russia,RKK Energia,LEO,Soyuz-FG,3,7.48,2.72,NaN,Solar panels,NaN,2002,2012,22,Sub-Orbital,NaN
24,Soyuz TMA-M11F747,Russia,RKK Energia,LEO,Soyuz-FG,3,7.48,2.72,7150,Solar panels,NaN,2010,2016,19,Sub-Orbital,NaN
25,Soyuz MS,Russia,RKK Energia,LEO,Soyuz-FG,3,7.48,2.72,NaN,Solar panels,NaN,2016,Active,3,Sub-Orbital,NaN
26,Federatsiya,Russia,RKK Energia,Lunar,Soyuz-5Angara 5,4,NaN,NaN,NaN,Solar panels,NaN,Planned: 2023,NaN,0,Sub-Orbital,NaN
27,Biconic Space Vehicle,USA,Blue Origin,LEO,New Glenn,NaN,NaN,NaN,NaN,NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
28,CST-100 Starliner,USA,Boeing,LEO,"multiple, initially Atlas V",7 [1],5.03 [2],4.56 [2],NaN,Solar panels,NaN,Planned: 2019,NaN,0,Sub-Orbital,NaN
29,Dream Chaser,USA,Sierra Nevada Corporation,LEO,"multiple, initially Atlas V",7 [3][4],9 [5],NaN,"11,300 [6]",NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
30,Dragon 2,USA,SpaceX,LEO,Falcon 9,7[note 14],8.1[7],3.7[8],"12,055 kg(26,577 lb)[9]",Solar Panels,NaN,Planned: 2019 (2019),Active,0(1),Sub-Orbital,"3,307/2,507"
31,Starship,USA,SpaceX,Solar System[10][note 15],BFR[10],100[note 16],55[10],9[10][note 17],"1,335,000[10]",Solar Panels,NaN,planned (2020) [10]planned 2023,NaN,0,Sub-Orbital,NaN

In [34]:
# Extract only US ships
ship_df = df3[df3.Origin == 'USA']
ship_df

,Spacecraft,Origin,Manufacturer,Range,Launchsystem,Crewsize,Length (m),Diameter (m),Launch mass (kg),Powersystem,Generatedpower (W),Firstspaceflight*,Lastspaceflight,Flights*,Orbit,Payloadto/from ISS (kg)
1,SpaceShipOne,USA,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3[note 18],Orbital,NaN
2,X-15,USA,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2[note 19],Orbital,NaN
3,New Shepard,USA,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019(2015),NaN,0 (10)[note 19],Orbital,NaN
4,SpaceShipTwo,USA,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8[note 20],18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2[note 21],Orbital,NaN
5,Mercury,USA,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961 (1960),1963,6(12)[note 1],Sub-Orbital,NaN
6,Gemini,USA,McDonnell AircraftMartin,LEO,Titan II GLVTitan IIIC[note 2],2,5.56,3.05,NaN,Fuel cells,NaN,1965 (1964),1966,10(2)[note 3],Sub-Orbital,NaN
7,Apollo,USA,North American AviationGrumman and Douglas,Lunar,Saturn IBSaturn V,3,8.5,3.91,"5,500 CM + 14,700 LM24,500 Service Module",Fuel cells,NaN,1967 (1966),1975,15(4)[note 3],Sub-Orbital,NaN
8,Space Shuttle orbiter,USA,United Space Alliance,LEO,Space Shuttle,8[note 4],37.24,4.8[note 5],109000,Fuel cells,NaN,1981,2011,135[note 6],Sub-Orbital,"12,500/16,000"
9,Orion,USA,Lockheed MartinAstrium,Mars,Delta IV HeavySpace Launch System,6,3.3,5,"8,900 Capsule12,300 Service Module",Solar Panels,NaN,Planned: 2021 (2014),NaN,0 (1)[note 7],Sub-Orbital,NaN
27,Biconic Space Vehicle,USA,Blue Origin,LEO,New Glenn,NaN,NaN,NaN,NaN,NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
28,CST-100 Starliner,USA,Boeing,LEO,"multiple, initially Atlas V",7 [1],5.03 [2],4.56 [2],NaN,Solar panels,NaN,Planned: 2019,NaN,0,Sub-Orbital,NaN
29,Dream Chaser,USA,Sierra Nevada Corporation,LEO,"multiple, initially Atlas V",7 [3][4],9 [5],NaN,"11,300 [6]",NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
30,Dragon 2,USA,SpaceX,LEO,Falcon 9,7[note 14],8.1[7],3.7[8],"12,055 kg(26,577 lb)[9]",Solar Panels,NaN,Planned: 2019 (2019),Active,0(1),Sub-Orbital,"3,307/2,507"
31,Starship,USA,SpaceX,Solar System[10][note 15],BFR[10],100[note 16],55[10],9[10][note 17],"1,335,000[10]",Solar Panels,NaN,planned (2020) [10]planned 2023,NaN,0,Sub-Orbital,NaN

In [35]:
# Rename Launchsytem, Crewsize, Powersystem, Payloadto/from ISS (kg), Firstspaceflight*, Lastspaceflight, Flights* fields
ship_df = ship_df.rename(columns={"Launchsystem":"Launch System", "Crewsize":"Crew Size", "Powersystem":"Power System", "Payloadto/from ISS (kg)":"Payload to/from ISS (kg)", "Firstspaceflight*":"First Space Flight","Lastspaceflight":"Last Space Flight", "Flights*":"Flights"})
ship_df.head()

,Spacecraft,Origin,Manufacturer,Range,Launch System,Crew Size,Length (m),Diameter (m),Launch mass (kg),Power System,Generatedpower (W),First Space Flight,Last Space Flight,Flights,Orbit,Payload to/from ISS (kg)
1,SpaceShipOne,USA,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3[note 18],Orbital,NaN
2,X-15,USA,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2[note 19],Orbital,NaN
3,New Shepard,USA,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019(2015),NaN,0 (10)[note 19],Orbital,NaN
4,SpaceShipTwo,USA,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8[note 20],18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2[note 21],Orbital,NaN
5,Mercury,USA,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961 (1960),1963,6(12)[note 1],Sub-Orbital,NaN

In [36]:
#Remove origin
ship_df = ship_df.drop(["Origin"], axis=1)

In [37]:
# Reset index
ship_df.reset_index(drop=True,inplace=True)
ship_df

,Spacecraft,Manufacturer,Range,Launch System,Crew Size,Length (m),Diameter (m),Launch mass (kg),Power System,Generatedpower (W),First Space Flight,Last Space Flight,Flights,Orbit,Payload to/from ISS (kg)
0,SpaceShipOne,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3[note 18],Orbital,NaN
1,X-15,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2[note 19],Orbital,NaN
2,New Shepard,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019(2015),NaN,0 (10)[note 19],Orbital,NaN
3,SpaceShipTwo,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8[note 20],18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2[note 21],Orbital,NaN
4,Mercury,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961 (1960),1963,6(12)[note 1],Sub-Orbital,NaN
5,Gemini,McDonnell AircraftMartin,LEO,Titan II GLVTitan IIIC[note 2],2,5.56,3.05,NaN,Fuel cells,NaN,1965 (1964),1966,10(2)[note 3],Sub-Orbital,NaN
6,Apollo,North American AviationGrumman and Douglas,Lunar,Saturn IBSaturn V,3,8.5,3.91,"5,500 CM + 14,700 LM24,500 Service Module",Fuel cells,NaN,1967 (1966),1975,15(4)[note 3],Sub-Orbital,NaN
7,Space Shuttle orbiter,United Space Alliance,LEO,Space Shuttle,8[note 4],37.24,4.8[note 5],109000,Fuel cells,NaN,1981,2011,135[note 6],Sub-Orbital,"12,500/16,000"
8,Orion,Lockheed MartinAstrium,Mars,Delta IV HeavySpace Launch System,6,3.3,5,"8,900 Capsule12,300 Service Module",Solar Panels,NaN,Planned: 2021 (2014),NaN,0 (1)[note 7],Sub-Orbital,NaN
9,Biconic Space Vehicle,Blue Origin,LEO,New Glenn,NaN,NaN,NaN,NaN,NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
10,CST-100 Starliner,Boeing,LEO,"multiple, initially Atlas V",7 [1],5.03 [2],4.56 [2],NaN,Solar panels,NaN,Planned: 2019,NaN,0,Sub-Orbital,NaN
11,Dream Chaser,Sierra Nevada Corporation,LEO,"multiple, initially Atlas V",7 [3][4],9 [5],NaN,"11,300 [6]",NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
12,Dragon 2,SpaceX,LEO,Falcon 9,7[note 14],8.1[7],3.7[8],"12,055 kg(26,577 lb)[9]",Solar Panels,NaN,Planned: 2019 (2019),Active,0(1),Sub-Orbital,"3,307/2,507"
13,Starship,SpaceX,Solar System[10][note 15],BFR[10],100[note 16],55[10],9[10][note 17],"1,335,000[10]",Solar Panels,NaN,planned (2020) [10]planned 2023,NaN,0,Sub-Orbital,NaN

In [38]:
# Remove square andd round bracketed notes from dataset
ship_df.replace("\[.*\]", "",regex=True, inplace=True)
ship_df.replace("\(.*\)", "",regex=True, inplace=True)
ship_df.head()

,Spacecraft,Manufacturer,Range,Launch System,Crew Size,Length (m),Diameter (m),Launch mass (kg),Power System,Generatedpower (W),First Space Flight,Last Space Flight,Flights,Orbit,Payload to/from ISS (kg)
0,SpaceShipOne,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3,Orbital,NaN
1,X-15,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2,Orbital,NaN
2,New Shepard,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019,NaN,0,Orbital,NaN
3,SpaceShipTwo,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8,18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2,Orbital,NaN
4,Mercury,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961,1963,6,Sub-Orbital,NaN

In [39]:
def assign_ship_id(item):
    result = "S-"+str(uuid.uuid4().fields[-1])[:5]
    return(result)
ship_df["Spacecraft ID"] = ship_df["Spacecraft"].apply(assign_ship_id)

id_column = ship_df.pop('Spacecraft ID')
ship_df.insert(0, id_column.name, id_column)
ship_df

,Spacecraft ID,Spacecraft,Manufacturer,Range,Launch System,Crew Size,Length (m),Diameter (m),Launch mass (kg),Power System,Generatedpower (W),First Space Flight,Last Space Flight,Flights,Orbit,Payload to/from ISS (kg)
0,S-11453,SpaceShipOne,Scaled Composites,112 kmX Prize,White KnightHybrid Motor,1,8.53,8.05,3600,NaN,NaN,2004,2004,3,Orbital,NaN
1,S-15283,X-15,North American Aviation,108 kmaltitude,B-52Ammonia-LOX,1,15.45,6.8,15420,NaN,NaN,1963,1963,2,Orbital,NaN
2,S-18866,New Shepard,Blue Origin,103 km,New Shepard BE-3,6,NaN,NaN,NaN,NaN,NaN,Planned: 2019,NaN,0,Orbital,NaN
3,S-19059,SpaceShipTwo,The Spaceship Company,110 kmKármán line+10,White Knight TwoRocketMotorTwo,8,18.3,8.3,9740,NaN,NaN,December 13 2018,NaN,2,Orbital,NaN
4,S-13341,Mercury,McDonnell AircraftNorth American Aviation,LEOattained,Redstone MRLVAtlas LV-3B,1,3.34,1.89,NaN,Batteries,NaN,1961,1963,6,Sub-Orbital,NaN
5,S-18775,Gemini,McDonnell AircraftMartin,LEO,Titan II GLVTitan IIIC,2,5.56,3.05,NaN,Fuel cells,NaN,1965,1966,10,Sub-Orbital,NaN
6,S-35278,Apollo,North American AviationGrumman and Douglas,Lunar,Saturn IBSaturn V,3,8.5,3.91,"5,500 CM + 14,700 LM24,500 Service Module",Fuel cells,NaN,1967,1975,15,Sub-Orbital,NaN
7,S-20033,Space Shuttle orbiter,United Space Alliance,LEO,Space Shuttle,8,37.24,4.8,109000,Fuel cells,NaN,1981,2011,135,Sub-Orbital,"12,500/16,000"
8,S-26871,Orion,Lockheed MartinAstrium,Mars,Delta IV HeavySpace Launch System,6,3.3,5,"8,900 Capsule12,300 Service Module",Solar Panels,NaN,Planned: 2021,NaN,0,Sub-Orbital,NaN
9,S-12884,Biconic Space Vehicle,Blue Origin,LEO,New Glenn,NaN,NaN,NaN,NaN,NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
10,S-13348,CST-100 Starliner,Boeing,LEO,"multiple, initially Atlas V",7,5.03,4.56,NaN,Solar panels,NaN,Planned: 2019,NaN,0,Sub-Orbital,NaN
11,S-19244,Dream Chaser,Sierra Nevada Corporation,LEO,"multiple, initially Atlas V",7,9,NaN,"11,300",NaN,NaN,Planned date not known,NaN,0,Sub-Orbital,NaN
12,S-56587,Dragon 2,SpaceX,LEO,Falcon 9,7,8.1,3.7,"12,055 kg",Solar Panels,NaN,Planned: 2019,Active,0,Sub-Orbital,"3,307/2,507"
13,S-26532,Starship,SpaceX,Solar System,BFR,100,55,9,"1,335,000",Solar Panels,NaN,planned planned 2023,NaN,0,Sub-Orbital,NaN

# Joining and Merging

In [40]:
# Extract Astronaut fields to append to Join table
name1 = astro_df[["Astro ID", "Last Name"]]
name1 = name1.rename(columns={"Last Name":"Crew"})

df_join = pd.merge(df_join, name1, on="Crew")
df_join.drop(["Crew"], axis=1, inplace=True)
df_join

,Mission ID,Mission,Given Craft Name,Launch Date,Mission Highlights,Craft Model,Astro ID
0,M-10478,41-B,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger,A-11762
1,M-24776,STS-35,Columbia,"December 2, 1990",This Spacelab mission performed astronomical e...,Columbia,A-11762
2,M-25768,STS-5,Columbia,"November 11, 1982",First operational flight of the Space Shuttle ...,Columbia,A-11762
3,M-10478,41-B,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger,A-10849
4,M-10478,41-B,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger,A-39928
5,M-17792,61-C,Columbia,"January 12, 1986",This mission had lots of problems and had to b...,Columbia,A-10849
6,M-17792,61-C,Columbia,"January 12, 1986",This mission had lots of problems and had to b...,Columbia,A-39928
7,M-82816,STS-27,Atlantis,"December 2, 1988",The third classified Department of Defense Shu...,Atlantis,A-10849
8,M-82816,STS-27,Atlantis,"December 2, 1988",The third classified Department of Defense Shu...,Atlantis,A-39928
9,M-21096,Skylab SL-4,Skylab,"November 15, 1973",These astronauts became the final crew of Skyl...,Skylab,A-10849
10,M-21096,Skylab SL-4,Skylab,"November 15, 1973",These astronauts became the final crew of Skyl...,Skylab,A-39928
11,M-10478,41-B,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger,A-12190
12,M-14146,51-L,Challenger,"January 28, 1986",All seven crew members were killed when Challe...,Challenger,A-12190
13,M-10478,41-B,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger,A-17274
14,M-93848,51-J,Atlantis,"October 3, 1985",The first flight of Shuttle Atlantis was the s...,Atlantis,A-17274
15,M-10478,41-B,Challenger,"February 3, 1984",The first untethered spacewalk in history was ...,Challenger,A-11033
16,M-79755,STS-31,Discovery,"April 24, 1990",Deployed the Hubble Space Telescope.,Discovery,A-11033
17,M-85349,41-C,Challenger,"April 6, 1984","This mission accomplished the first capture, r...",Challenger,A-13412
18,M-68756,51-I,Discovery,"August 27, 1985","The astronauts deployed two satellites, then r...",Discovery,A-13412
19,M-48283,41-D,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery,A-86762
20,M-82816,STS-27,Atlantis,"December 2, 1988",The third classified Department of Defense Shu...,Atlantis,A-86762
21,M-16920,STS-36,Atlantis,"February 28, 1990",The sixth classified Department of Defense Shu...,Atlantis,A-86762
22,M-48283,41-D,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery,A-27165
23,M-17792,61-C,Columbia,"January 12, 1986",This mission had lots of problems and had to b...,Columbia,A-27165
24,M-79755,STS-31,Discovery,"April 24, 1990",Deployed the Hubble Space Telescope.,Discovery,A-27165
25,M-48283,41-D,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery,A-93957
26,M-84164,STS-29,Discovery,"March 13, 1989",This mission deployed the third tracking and d...,Discovery,A-93957
27,M-30002,STS-39,Discovery,"April 28,1991",This unclassified Department of Defense Shuttl...,Discovery,A-93957
28,M-48283,41-D,Discovery,"August 30, 1984",First flight of the Shuttle Discovery. The Con...,Discovery,A-60051
29,M-10763,61-A,"Challenger, Spacelab D1","October 30, 1985",Spacelab D1 was controlled by the West German ...,"Challenger,",A-60051
...,...,...,...,...,...,...,...
216,M-18168,STS-8,Challenger,"April 30, 1983",Bluford became the first African-American to g...,Challenger,A-43123
217,M-16385,STS-34,Atlantis,"October 18, 1989","Deployed the space probe Galileo, sending it o...",Atlantis,A-69062
218,M-16385,STS-34,Atlantis,"October 18, 1989","Deployed the space probe Galileo, sending it o...",Atlantis,A-14220
219,M-16385,STS-34,Atlantis,"October 18, 1989","Deployed the space probe Galileo, sending it o...",Atlantis,A-13240
220,M-24776,STS-35,Columbia,"December 2, 1990",This Spacelab mission performed astronomical e...,Columbia,A-27891
221,M-40854,STS-9,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,",A-27891
222,M-16920,STS-36,Atlantis,"February 28, 1990",The sixth classified Department of Defense Shu...,Atlantis,A-24599
223,M-16920,STS-36,Atlantis,"February 28, 1990",The sixth classified Department of Defense Shu...,Atlantis,A-12793
224,M-16823,STS-37,Atlantis,"April 5, 1991",Deployed the Gamma Ray Observatory.,Atlantis,A-93866
225,M-16823,STS-37,Atlantis,"April 5, 1991",Deployed the Gamma Ray Observatory.,Atlantis,A-81449
226,M-16823,STS-37,Atlantis,"April 5, 1991",Deployed the Gamma Ray Observatory.,Atlantis,A-16681
227,M-59039,STS-38,Atlantis,"November 15, 1990",The last classified Department of Defense Shut...,Atlantis,A-24251
228,M-59039,STS-38,Atlantis,"November 15, 1990",The last classified Department of Defense Shut...,Atlantis,A-18521
229,M-59039,STS-38,Atlantis,"November 15, 1990",The last classified Department of Defense Shut...,Atlantis,A-27143
230,M-30002,STS-39,Discovery,"April 28,1991",This unclassified Department of Defense Shuttl...,Discovery,A-19281
231,M-30002,STS-39,Discovery,"April 28,1991",This unclassified Department of Defense Shuttl...,Discovery,A-15041
232,M-30002,STS-39,Discovery,"April 28,1991",This unclassified Department of Defense Shuttl...,Discovery,A-10051
233,M-19404,STS-41,Discovery,"October 6, 1990","Deployed the Ulysses space probe, sending it o...",Discovery,A-76046
234,M-19404,STS-41,Discovery,"October 6, 1990","Deployed the Ulysses space probe, sending it o...",Discovery,A-95393
235,M-19404,STS-41,Discovery,"October 6, 1990","Deployed the Ulysses space probe, sending it o...",Discovery,A-24680
236,M-25768,STS-5,Columbia,"November 11, 1982",First operational flight of the Space Shuttle ...,Columbia,A-16772
237,M-25768,STS-5,Columbia,"November 11, 1982",First operational flight of the Space Shuttle ...,Columbia,A-12158
238,M-41515,STS-6,Challenger,"April 4, 1983",First flight of Shuttle Challenger. The first ...,Challenger,A-10026
239,M-41515,STS-6,Challenger,"April 4, 1983",First flight of Shuttle Challenger. The first ...,Challenger,A-28028
240,M-23204,Skylab SL-2,Skylab,"May 25, 1973","The first American laboratory in space, Skylab...",Skylab,A-28028
241,M-40854,STS-9,"Columbia, Spacelab","November 28, 1983",First flight of the European Space Agency's Sp...,"Columbia,",A-18776
242,M-25075,Skylab SL-3,Skylab,"July 23, 1973",These astronauts became the second crew of Sky...,Skylab,A-18776
243,M-23204,Skylab SL-2,Skylab,"May 25, 1973","The first American laboratory in space, Skylab...",Skylab,A-21292
244,M-21096,Skylab SL-4,Skylab,"November 15, 1973",These astronauts became the final crew of Skyl...,Skylab,A-27115
245,M-21096,Skylab SL-4,Skylab,"November 15, 1973",These astronauts became the final crew of Skyl...,Skylab,A-16224

In [41]:
# Extract Ship fields to append to Join table
ship1 = ship_df[["Spacecraft ID", "Spacecraft"]]
ship1 = ship1.rename(columns={"Spacecraft":"Craft Model"})

df_join = pd.merge(df_join, ship1, on="Craft Model")
df_join.drop(["Craft Model"], axis=1, inplace=True)
df_join

,Mission ID,Mission,Given Craft Name,Launch Date,Mission Highlights,Astro ID,Spacecraft ID
0,M-10205,Apollo-Saturn 10,Apollo 10cm: Charlie Brownlm: Snoopy,"May 18, 1969",This mission was a dress rehearsal for a lunar...,A-80226,S-35278
1,M-11991,Apollo-Saturn 17,Apollo 17cm: Challengerlm: America,"December 7, 1972",Apollo 17 was the last lunar landing mission. ...,A-80226,S-35278
2,M-10205,Apollo-Saturn 10,Apollo 10cm: Charlie Brownlm: Snoopy,"May 18, 1969",This mission was a dress rehearsal for a lunar...,A-25269,S-35278
3,M-21659,Apollo-Saturn 16,Apollo 16cm: Casperlm: Orion,"April 16, 1972",Young and Duke visited the previously unexplor...,A-25269,S-35278
4,M-10205,Apollo-Saturn 10,Apollo 10cm: Charlie Brownlm: Snoopy,"May 18, 1969",This mission was a dress rehearsal for a lunar...,A-70375,S-35278
5,M-39898,Apollo-Saturn 11,Apollo 11cm: Columbialm: Eagle,"July 16, 1969",Apollo 11 successfully completed the first man...,A-15342,S-35278
6,M-39898,Apollo-Saturn 11,Apollo 11cm: Columbialm: Eagle,"July 16, 1969",Apollo 11 successfully completed the first man...,A-16720,S-35278
7,M-39898,Apollo-Saturn 11,Apollo 11cm: Columbialm: Eagle,"July 16, 1969",Apollo 11 successfully completed the first man...,A-19345,S-35278
8,M-39898,Apollo-Saturn 11,Apollo 11cm: Columbialm: Eagle,"July 16, 1969",Apollo 11 successfully completed the first man...,A-37453,S-35278
9,M-24600,Apollo-Saturn 12,Apollo 12cm: Yankee Clipperlm: Intrepid,"November 14, 1969",Apollo 12 made the second landing on the moon....,A-13511,S-35278
10,M-24600,Apollo-Saturn 12,Apollo 12cm: Yankee Clipperlm: Intrepid,"November 14, 1969",Apollo 12 made the second landing on the moon....,A-21584,S-35278
11,M-24600,Apollo-Saturn 12,Apollo 12cm: Yankee Clipperlm: Intrepid,"November 14, 1969",Apollo 12 made the second landing on the moon....,A-26491,S-35278
12,M-25979,Apollo-Saturn 13,Apollo 13cm: Odysseylm: Aquarius,"April 11, 1970",The third manned lunar landing was aborted due...,A-23642,S-35278
13,M-25979,Apollo-Saturn 13,Apollo 13cm: Odysseylm: Aquarius,"April 11, 1970",The third manned lunar landing was aborted due...,A-26709,S-35278
14,M-25979,Apollo-Saturn 13,Apollo 13cm: Odysseylm: Aquarius,"April 11, 1970",The third manned lunar landing was aborted due...,A-88318,S-35278
15,M-19951,Apollo-Saturn 8,Apollo 8,"December 21, 1968",This Saturn 5 rocket sent the astronauts to th...,A-88318,S-35278
16,M-77791,Apollo-Saturn 14,Apollo 14cm: Kitty Hawklm: Antares,"January 31, 1971",Apollo 14 was the third successful lunar landi...,A-78197,S-35278
17,M-77791,Apollo-Saturn 14,Apollo 14cm: Kitty Hawklm: Antares,"January 31, 1971",Apollo 14 was the third successful lunar landi...,A-22935,S-35278
18,M-77791,Apollo-Saturn 14,Apollo 14cm: Kitty Hawklm: Antares,"January 31, 1971",Apollo 14 was the third successful lunar landi...,A-21199,S-35278
19,M-21155,Apollo-Saturn 15,Apollo 15cm: Endeavourlm: Falcon,"July 26, 1971",Scott and Irwin became the first astronauts to...,A-58143,S-35278
20,M-21155,Apollo-Saturn 15,Apollo 15cm: Endeavourlm: Falcon,"July 26, 1971",Scott and Irwin became the first astronauts to...,A-23650,S-35278
21,M-14696,Apollo-Saturn 9,Apollo 9cm: Gumdroplm: Spider,"March 3, 1969",McDivitt and Schweickart made the first manned...,A-23650,S-35278
22,M-21155,Apollo-Saturn 15,Apollo 15cm: Endeavourlm: Falcon,"July 26, 1971",Scott and Irwin became the first astronauts to...,A-14009,S-35278
23,M-21659,Apollo-Saturn 16,Apollo 16cm: Casperlm: Orion,"April 16, 1972",Young and Duke visited the previously unexplor...,A-26775,S-35278
24,M-11991,Apollo-Saturn 17,Apollo 17cm: Challengerlm: America,"December 7, 1972",Apollo 17 was the last lunar landing mission. ...,A-95902,S-35278
25,M-11991,Apollo-Saturn 17,Apollo 17cm: Challengerlm: America,"December 7, 1972",Apollo 17 was the last lunar landing mission. ...,A-12564,S-35278
26,M-23868,Apollo-Saturn 204,Apollo 1,"January 27, 1967",While training for a fourteen-day mission sche...,A-17856,S-35278
27,M-23868,Apollo-Saturn 204,Apollo 1,"January 27, 1967",While training for a fourteen-day mission sche...,A-14747,S-35278
28,M-14056,Apollo-Saturn 7,Apollo 7,"October 11, 1968",The Apollo spacecraft makes its first flight a...,A-14471,S-35278
29,M-14056,Apollo-Saturn 7,Apollo 7,"October 11, 1968",The Apollo spacecraft makes its first flight a...,A-26522,S-35278
30,M-14056,Apollo-Saturn 7,Apollo 7,"October 11, 1968",The Apollo spacecraft makes its first flight a...,A-21124,S-35278
31,M-19951,Apollo-Saturn 8,Apollo 8,"December 21, 1968",This Saturn 5 rocket sent the astronauts to th...,A-24771,S-35278
32,M-19951,Apollo-Saturn 8,Apollo 8,"December 21, 1968",This Saturn 5 rocket sent the astronauts to th...,A-25116,S-35278
33,M-14696,Apollo-Saturn 9,Apollo 9cm: Gumdroplm: Spider,"March 3, 1969",McDivitt and Schweickart made the first manned...,A-13534,S-35278
34,M-14696,Apollo-Saturn 9,Apollo 9cm: Gumdroplm: Spider,"March 3, 1969",McDivitt and Schweickart made the first manned...,A-26138,S-35278
35,M-82798,Gemini-Titan 9-A,Gemini 9,"June 3,1966",Gemini 9 rendezvoused with the Augmented Targe...,A-80226,S-18775
36,M-14071,Gemini-Titan 10,Gemini 10,"July 18,1966",Gemini 10 reached a record altitude of 468 mil...,A-25269,S-18775
37,M-25688,Gemini-Titan 6-A,Gemini 6,"December 15,1965",Gemini 6 rendezvoused with Gemini 7 coming wit...,A-70375,S-18775
38,M-82798,Gemini-Titan 9-A,Gemini 9,"June 3,1966",Gemini 9 rendezvoused with the Augmented Targe...,A-70375,S-18775
39,M-95275,Gemini-Titan 12,Gemini 12,"November 11, 1966","In this last Gemini mission, Aldrin made three...",A-15342,S-18775
40,M-14071,Gemini-Titan 10,Gemini 10,"July 18,1966",Gemini 10 reached a record altitude of 468 mil...,A-16720,S-18775
41,M-14071,Gemini-Titan 10,Gemini 10,"July 18,1966",Gemini 10 reached a record altitude of 468 mil...,A-19345,S-18775
42,M-25432,Gemini-Titan 8,Gemini 8,"March 16,1966",Armstrong and Scott perform the first docking ...,A-37453,S-18775
43,M-18924,Gemini-Titan 11,Gemini 11,"September 12, 1966",Gemini made the first American autopilot reent...,A-13511,S-18775
44,M-13645,Gemini-Titan 5,Gemini 5,"August 21, 1965",Cooper and Conrad set the world endurance reco...,A-13511,S-18775
45,M-18924,Gemini-Titan 11,Gemini 11,"September 12, 1966",Gemini made the first American autopilot reent...,A-26491,S-18775
46,M-95275,Gemini-Titan 12,Gemini 12,"November 11, 1966","In this last Gemini mission, Aldrin made three...",A-88318,S-18775
47,M-23497,Gemini-Titan 7,Gemini 7,"December 4, 1965",This mission set yet another endurance record ...,A-88318,S-18775
48,M-25432,Gemini-Titan 8,Gemini 8,"March 16,1966",Armstrong and Scott perform the first docking ...,A-23650,S-18775
49,M-25688,Gemini-Titan 6-A,Gemini 6,"December 15,1965",Gemini 6 rendezvoused with Gemini 7 coming wit...,A-26522,S-18775
50,M-23497,Gemini-Titan 7,Gemini 7,"December 4, 1965",This mission set yet another endurance record ...,A-25116,S-18775
51,M-79354,Gemini-Titan 4,Gemini 4,"June 3, 1965",This mission set a four-day endurance record. ...,A-13534,S-18775

# Load to SQL

In [42]:
#Build connection
conn = sqlite3.connect('NASA.db')  
c = conn.cursor()

In [43]:
#Load astro_df to table
astro_df.to_sql('ASTRONAUTS', conn, if_exists='replace', index=False)

#Load mission_df to table
mission_df.to_sql('MISSIONS', conn, if_exists='replace', index=False)

#Load ship_df to table
ship_df.to_sql('SPACESHIPS', conn, if_exists='replace', index=False)

#Loat join_df to table
df_join.to_sql('MASTER', conn, if_exists='replace', index=False)

C:\Users\Asha\Anaconda3\lib\site-packages\pandas\core\generic.py:2130: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype)